{"podcast_details": {"podcast_title": "Sahih Bukhari The Book Of Night Prayers", "episode_title": "Episode-17-Lesson-159-Chapter-36-37-Hadith- 1185-1187", "episode_image": "http://alhudamedia.com/Fh_Podcast/Bukhari-21.png", "episode_transcript": " Bab, Salatin nawafili jama'atan. Performing voluntary prayers, how? Jama'atan in congregation, in a group. Now here, what is meant is all nawafil. Whatever that voluntary prayer may be. Okay? Any voluntary prayer, performing it in congregation. What's the proof of that? Dhakarahu anasun wa aisha, radiyaAllahu anhumah. He's saying that anas and aisha both reported it, on the Nabi'a salallahu alayhi wa sallam, from the Prophet salallahu alayhi wa sallam. When did anas radiyaAllahu anhu reported? The hadith of anas radiyaAllahu anhu is the one in which the Prophet salallahu alayhi wa sallam visited the house of Um Sulaym. And he performed the prayer over there. And it was in congregation, it was not fard. And anas radiyaAllahu anhu and another orphan boy, they both formed a row behind the Prophet salallahu alayhi wa sallam. Okay? So this is reported in Bukhari. So we see that voluntary prayer is being performed in congregation. What is the narration of aishaAllahu anhu? That is also mentioned in Bukhari. It was mentioned earlier in the book, where the Prophet salallahu alayhi wa sallam performed the night prayer. AishaAllahu anhu reported that. He performed the night prayer and the people joined him in the night prayer. So these two narrations prove that it is correct to perform voluntary prayer in congregation. Another clear hadith, Imam Bukhari mentions, long hadith but very interesting. Haddathni Ishaaq, haddathna Yaqoob ibn Ibrahim, haddathna Abi, anibni Shihabin, qala akhbarani Mahmood ibn al-Rabi' al-Ansari, anahu akhla Rasool Allah salallahu alayhi wa sallam. So Mahmood bin Rabir, Mahmood bin Rabir al-Ansari, he was from the Ansar radiAllahu anhu, he is reporting that he akhla, akhla, what does akhla mean? That he remembered. He remembered the Prophet salallahu alayhi wa sallam. What does it mean by this? He remembered him. Mahmood radiAllahu anhu was a very little boy, very little boy when he met the Prophet salallahu alayhi wa sallam. He was from Madinah but he was of the little children of Madinah. And wa akhla, and he specifically remembered majjatan, the majjah. Majjah is to take water in one's mouth and then spit it out. This is a majjah. To spit water out of one's mouth. So he remembered the majjah, that majjah fi wajhihi. That the Prophet salallahu alayhi wa sallam spat, alright, where? Fi wajhihi in his face, min bi'rin. And that water was taken from a well, kanat fi daarihim, that was in their house. Now Mahmood bin Rabir was five years old, very little boy. When the Prophet salallahu alayhi wa sallam came to his house, there was a well in their house. The water was taken out of there. And as this hadith is mentioned earlier in kitab al-ilm, Imam Bukhari mentions it in greater detail in kitab al-ilm. And we learned that the Prophet salallahu alayhi wa sallam, he sprayed some water on the face of this little boy Mahmood. Why would he do that? There's different reasons that are given by the ulama. One reason is play. Has it ever happened with you that you're doing something and little children they just come and start staring at you? They just come and watch you, like do everything? So what happens at that time? Even if you don't know those children, you play along. Isn't it? You play along. And the way you would play with them will be according to your culture. Isn't it? What might be acceptable in your culture might not be acceptable in another culture at all. Recently I was at a grocery store and this little boy was with me. And this boy, he's lived the majority of his life in another country. So he's still not, I mean, yes he is Canadian, but he's not fully Canadian. You know what I mean? So this little kid, this boy, he's standing and there's a little baby in a cart. This little baby is staring at this boy. So this boy starts playing with that little baby, going a little too close to that baby. And I'm like, okay, you don't do that here. But he kept doing that. He was going very close to the baby and the mother was looking and kind of smiling, but you could tell from her face that she was a little uncomfortable. That why is this kid coming so close to my child? So she pushed the trolley away. So the point is that for this kid it was something very normal. He had no concept of personal space. But for other people it's like I need, you have to respect our personal space. You can smile at me from a distance, but you can't come very close to me. If you go to some other parts of the world, people will randomly touch your baby, pick him up, start kissing him on his cheek, oh my God. They will literally kiss your baby on the cheek, and you will see the lipstick marks on the cheek and you're like, I don't know what you've had and what's in your body, but you're putting your germs on my child's skin. For example, people have different ways. So you might feel uncomfortable with one way, manner of playing, and other people might be perfectly cool with it. So the Prophet Sallallahu Alaihi Wasallam, he was doing wudu perhaps, he was washing up and he took a mouthful of water and he sprayed it on the face of Mahmud. He was playing with him. This is one explanation. Another explanation that Urdu Ma'a have given is that the Prophet Sallallahu Alaihi Wasallam did this for tabarruq, to kind of bless the boy. Because remember that the Prophet Sallallahu Alaihi Wasallam, I mean his body was blessed, and there's numerous proofs of that. The Sahaba would even value his sweat. It was his body, a blessed body. So this was for the purpose of tabarruq. Now Mahmud, he was only five years old when this incident happened. And here it is mentioned that he remembered this. He remembered this. And based on this narration, the scholars say that you can accept hadith from even a child. Because he is narrating this incident about the life of the Prophet Sallallahu Alaihi Wasallam, when he was how old? Only five years old. Five years old. So as long as a child can remember correctly, it doesn't matter how old or young they are. It's not the age that matters, it is the knowledge that matters. So he was five years old when this incident happened, and he reported this, and it was accepted from him. So anyway, Mahmud bin al-Rabir al-Ansari, he claimed, he said, Mahmud said that he heard Itban bin Malik al-Ansari, and Itban bin Malik was of those people who had witnessed Badr ma'a Rasulillahi Sallallahu Alaihi Wasallam with the Prophet Sallallahu Alaihi Wasallam. So he said that he heard from Itban bin Malik, yaqulu that he said, kuntu usalli li qawmi bibani salim. So what's happening over here? Mahmud heard from who? Itban bin Malik. Who's Itban bin Malik? He's of those companions who participated in Badr. And Itban, Radillahu Anhu, is narrating that I used to pray for my people amongst the Banu Salim, meaning I used to lead them in prayer, wakana yahulu bayni wa baynahum wadin. And there was a valley between me and them, meaning between my house and the rest of the houses of Banu Salim, there was a valley. idha ja'atil amtaaru, when the rains would come, meaning when there would be a lot of rainfall, fayashuq wa alayyaj tiyazuhu. It would be difficult for me to cross that valley qibala masjidehim towards their masjid. So why would it be difficult? Because that valley would get flooded. Faj'i'tu Rasulillahi Sallallahu Alaihi Wasallam. So I came to the Prophet Sallallahu Alaihi Wasallam, and I said to him that inni ankartu basari. My vision is going bad, meaning I no longer see very clearly. Wa inna al wadiya alladhi bayni wa baynah quwami. And the valley which is between me and my people, yaseelu. It gets flooded. idha ja'atil amtaaru, when there is a lot of rain. fayashuq wa alayyaj tiyazuhu. Then it is difficult for me to cross the valley. So in other words he is saying I cannot pray in congregation then when it rains. fawadidtu anna ka ta'ati, fatusalli min bayti. So I really want that you come and pray in my house makanan in a place attakhiluhu musalla, which I can take as a prayer place. I really want you to come to my house and pray so that I can make that place where you pray as my musalla. faqala rasulullahi salallahu alayhi wa sallam sa af'alu. So the Prophet salallahu alayhi wa sallam said sa af'alu, I will do that. He did not refuse. fa gada alayya rasulullahi salallahu alayhi wa sallam wa abu bakarin. So Uthban is saying that the Prophet salallahu alayhi wa sallam came in the morning. He came and with him abu bakar radiallahu anhu also came. When? ba'ada mashtadda annahaar after the day had fully risen, after it had become intense, meaning the daylight had settled. It was daytime. So this is around duha time. When he came, fa sta'adha rasulullahi salallahu alayhi wa sallam, the Prophet salallahu alayhi wa sallam asked for permission. Permission for what? To enter his house. fa adhintu lahoo so I allowed him. And when he came in, fa lam yajlis he did not sit down hatta qala until he said, ayna tuhibbu an usalliya min baytik. Where do you want me to pray in your house? Notice something? When he walked in he did not sit down until he inquired about where he should pray. Because he came for the salah, right? He did not come to chill. He came to pray. So he was focused on his purpose. And this is something very important that we need to remember also. We go for one thing and we get distracted. We go to the masjid to pray, we don't even pray. We get distracted. We go to a class and we are not even sitting in class. Distracted. Remember why you have taken the time out, sacrificed, left so many things, and come to a place you did not come there to chill. You did not come there to daydream. You did not come there to kill your time. You came there for a purpose. So fulfill that purpose and then do other things. Then do other things. And I know that as students sometimes you have many distractions. You have your phone, you have other people, other people are coming in, you want to talk, you want to see what's happening. No, everything else is secondary. Everything else is secondary. And if you keep getting distracted by this person and that person, by this thing and that thing, you'll never accomplish anything. I don't know how many of you can even think about taking a test when you have not studied the entire chapter or when you have not attended the entire class. I don't know how you can do that. I never did that as a student, never. I still don't do it. Every time I'm taking a class I want to make sure that I have studied, I have read cover to cover, I have listened to the lecture, beginning to end. We have such a casual attitude, we listen to some part, miss some other part, coming late to class, leaving early, going in the middle. Why? How long is a class? An hour, 15 minutes maximum? And if we're spending 10 minutes in the bathroom, what are we doing? If we're spending 10 minutes attending a phone call, we're leaving something that we came for. This is injustice to yourself. You're being unfair to yourself, where you're coming to seek knowledge, and instead of studying, you're busy with other things. Be fair to yourself, be good to yourself. So the Prophet ﷺ did not sit down until he asked, where do you want me to pray? So what happened? So I pointed him to the place in which I wanted him to pray. Look at the Prophet ﷺ also. He's not saying, well, I can pray wherever I want. No, he's asking him, where would you like me to pray? So the Prophet ﷺ stood, he said the takbir, wasafafna waraahu, and we formed rows behind him. Fasalla raka'atain, then he performed two raka'at. Thumma sallama, then he said the taslim, wasallamna, and we also said the taslim, heena sallama, when he said the taslim. So this is the part which proves to us that it is sunnah to perform voluntary prayers in congregation whenever there is a need. So the Prophet ﷺ led the prayer, Abu Bakr radi laahu wa anhu, Itban bin Malik, and whoever else was there prayed behind him. And notice also that the Prophet ﷺ said the salam, and we said the salam when he said the salam. Not when we wanted to say the salam. Because imam is to be followed. So when the imam says Allahu Akbar, what are we supposed to do? Let me complete my surah? No. You stop where you are, and you join, you follow. So even when he is saying the salam, you have to stop what you are saying and say the salam. Now what happened? Salah is done. The work for which the Prophet ﷺ came is done. So now, once the work is done, can we chill? Yes we can. So what happened? Itban bin Malik said, فَحَبَسْتُهُ So I kept him. Habs means to retain something, to keep it. So he said I kept him, meaning I did not let him go. I insisted that he should stay. For what? على خَزِيرٍ For khazir. Khazir is a stew, some food in which there is meat, there is gravy or there is soup in it also. So for some khazir يُصنعُ لهُ which had been prepared for him. Interesting, huh? He called him to pray, but he also had food prepared. And this is of the noble qualities, that when somebody is coming to your place, then you serve them some food. Ibrahim ﷺ, did he prepare food for the guests who came? Suddenly those guests came, so he went and brought roasted meat. So here also يُصنعُ لهُ that food was especially prepared for him ﷺ. So what happened? The Prophet ﷺ agreed, he stayed for the food, and then فَسَمِعَ أَهْلُ الدَّارِ رَسُولَ اللَّهِ ﷺ فِي بَيْتِي So the people of the daar, daar house, the people of the house, meaning in the surrounding area, where this, the Banu Salim, right? The Banu Salim, they used to live in this area, right? So in the Banu Salim, they found out that the Prophet ﷺ was in my house, in the house of Itban. What happened? فَثَابَ رِجَالٌ مِّنْهُمْ So the men amongst them started coming, okay? They gathered. حَتَّى كَثُرَ الرِّجَالُ فِي الْبَيْتِ Until there were so many men in my house. Too many men, too many people. They heard the Prophet ﷺ is here, so they all came. And then they're all talking, they're eating. فَقَالَ رَجْلٌ مِّنْهُمْ So a man amongst them said, ما فعل مالكٌ لَأَرَاهُ What did Malik do? Where is Malik? I don't see him. Where did he go? فَقَالَ رَجْلٌ مِّنْهُمْ So another man amongst them, he said, ذَاكَ مُنافقْ He's a munafiq, he's a hypocrite. لا يُحِبُّ اللَّهَ وَرَسُولَةً He does not love Allah and His Messenger. That's why he's not here. Because if he was really a believer, and if he loved Allah and His Messenger, then he would be present in this gathering. فَقَالَ رَسُولُ اللَّهِ ﷺ So the Prophet ﷺ said, لا تَقُل ذَاكَ Do not say that. أَلَا تَرَاهُ Did you not see him? قَالَ لَا إِلَهَ إِلَّا اللَّهِ He has said, لا إله إلا الله يَبْتَغِ بِذَلِكَ وَجْهَ اللَّهِ And he wanted by that the face of Allah, meaning he said the kalima seeking who? Seeking Allah. فَقَالَ So that man, he said, اللَّهُ وَرَسُولُهُ أَعْلَمْ Allah and His Messenger know best. As to who that man is, whether he is really a believer or a hypocrite. أَمَّا نَحْنُ As for us, فَوَالَّهِ لَا نَرَا وُدَّهُ Then by Allah, we do not see his love ولا حديثه nor his speech إِلَّا إِلَى الْمُنَافِقِينَ Except that it is directed to the hypocrites. We have seen him loving the hypocrites and talking with the hypocrites a lot. That's what we have seen. He hangs out with them. So this is why we think that he is one of them. قَالَ رَسُولُ اللَّهِ صَلَلَّهُ أَلَيُّهُ سَلَّمٍ The Prophet said, فَإِنَّ اللَّهَ قَدَ حَرَّمَ عَلَى الْنَّارِ Indeed Allah has forbidden on the fire من قال لا إله إلا الله Whoever says, لا إله إلا الله Then such a person is forbidden on the fire. يَبْتَغِي بِدَالِكَ وَجْهَ اللَّهِ If he says, لا إله إلا الله While seeking by that the face of Allah. Meaning he says it with sincerity, then this person will be forbidden on hellfire. Now what do we see here? This was a very big claim to make in front of the Prophet صلى الله عليه وسلم, right? That that man is a hypocrite. He does not like Allah and His Messenger. In fact, it's almost rude. Imagine somebody telling you on your face, he doesn't like you, she doesn't like you. It's insulting, it's hurtful. It's like, okay, they don't like me, but you don't have to tell me. But what did they say? They said, this man said this man is a hypocrite, he does not like Allah and His Messenger. And he's saying this to the Messenger صلى الله عليه وسلم. So it's disrespectful also. It's a big claim, and it's also disrespectful. So what happened? The Prophet صلى الله عليه وسلم was very wise, right? He would always put things where they belonged. So he corrected the people that don't make such a claim. Now, قال محمود, Mahmood who heard this hadith from Itban, and he narrated this hadith, what happened? Mahmood said, فحدستها قومن I narrated this hadith to different people, because it's a very interesting incident, right? I mean, the Prophet صلى الله عليه وسلم is coming to somebody's house first, there's a blind man who has an issue with his vision, not able to go to the masjid, the Prophet صلى الله عليه وسلم is going to his house, praying there. There's so much to learn from this incident. So he said, I narrated this hadith to a people, فيهم أبو أيوب and amongst those people was also أبو أيوب. Who is أبو أيوب? صاحب رسول الله صلى الله عليه وسلم في غزوته The companion, صاحب رسول الله صلى الله عليه وسلم he was a companion of the Prophet صلى الله عليه وسلم. This is أبو أيوب الأنصاري, the companion in whose house the Prophet صلى الله عليه وسلم stayed when he arrived in Medina. So he said, I mentioned this hadith to أبو أيوب رضي الله عنه also, when في غزوته in his battle, التي توفية فيها in which he died. The battle in which أبو أيوب died is the same battle in which I had mentioned this hadith to him. Okay? Which was this battle? ويزيد بن معاوية عليهم يزيد بن معاوية was their leader. This is after, after who? The time of Abu Bakr? The time of Umar? The time of Uthman رضي الله عنه. Because after that we see that معاوية رضي الله عنه he had appointed his son as a leader of many expeditions and then later يزيد also became the Khalifa. So anyway, this was a battle in which يزيد was their leader بأرض الروم and this was a battle in the land of Rome. Now, Mahmoud narrated this hadith to أبو أيوب when? In a battle. Okay? In a battle. And later in that same battle, أبو أيوب died. He was killed. Now, interesting thing is that they're gone for a battle. It doesn't mean that the battle is going on at that time, but during this incident, they're reporting hadith to one another. That is beautiful. That they're reporting hadith to one another even at a time of battle. Now, what happened when he reported this hadith to أبو أيوب? فأنكرها علي أبو أيوب أبو أيوب rejected me. He said, قَالَهِ سَلُوَ اللَّهِ مَا أَظُنُّ رَسُولَ اللَّهِ صَلَى اللَّهُ أَلَيُّهُ وَسَلَّمَهُ قَالَ مَا قُلْتَ قَطُّ He said, by Allah, I don't think the Prophet ﷺ ever said what you're saying he said. What? That if a person says لا إله إلا الله sincerely, then the fire is forbidden on him. أبو أيوب says there's no way the Prophet ﷺ could have said that. فَكَبُرَ ذَلِكَ عَلَيّْا So Mahmood he said this was very difficult for me. He had heard this hadith from Itban and he had narrated it to so many people and here Abu Ayyub al-Ansari r.a. is saying no way the Prophet ﷺ could not have said this. So this was very difficult for him. Am I wrong? Did I misunderstand? Am I making things up? Like what's going on? He doubted himself. فَكَبُرَ ذَلِكَ عَلَيَّةَ فَجَعَلْتُ لِلَّهِ عَلَيَّةَ So I made a promise with Allah that إن سَلَّمَني that if Allah would protect me, meaning if I survive the battle, حَتَّ أَقْفُلَ مِنْ غَزْوَتِ that I leave the battle fine أن أسأل عنها عِتْبَانَ ابن مالك رضي الله عنه that I will go and ask عِتْبَانَ مِنْ مالك رضي الله عنه إن وجَتْهُ حَيًّا if I were to find him alive في مسجد قومه in the masjid of his people. So he made a commitment. He said if I survive this battle, I'm going to go to the masjid of the people of the world, I'm going to find him. If he's alive, I'm going to ask him about this hadith again. So what happened? فَقَفَلْتُ So I returned. فَأَهْلَلْتُ بِحَجَّةٍ أَو بِعُمُرَةٍ And I made the talbiya for hajj or umrah. He put on the ihram. Because if you're going all the way to Medina from the land of Rome, you might as well do umrah or hajj. ثمَّ سِرْتُ حَتَّى قَدِمْتُ الْمَدِينَ He said then I traveled until I reached Medina. فَأَتَيْتُ بَنِي سَالِمْ I came to the Banu Salim where they used to live. فَإِذَا إِتْبَانُ شَيْخٌ He said there was Ithban, رضي الله عنه, a sheikh, an old man, a'ma, who had become completely blind now, يُصَلِّ لِقَوْمِهِ And he was still leading his people in prayer. That's what he found him doing. فَلَمَّا سَلَّمَ مِنَ الصَّلَاءِ Then when he said the tisleem from the Salah, he ended the prayer سَلَّمْتُ عَلَيْهِ I greeted him. And I told him about who I was. Why? Because now Ithban was old and he was blind. So Mahmood introduced himself, reminded him of who he was. ثمَّ سَأَلْتُهُ عَن ذَلِكَ الْحَدِيزِ And then I asked him about that hadith. وَحَدَّثَنِيهِ كَمَا حَدَّثَنِيهِ أَوَّلَ مَرَّةً And he said the same thing to me كما أحدثنيه كما أحدثنيه أول مرة So he narrated that hadith to me just as he narrated it to me the first time. So what do we see here? Too many things. Firstly, we see that Mahmood, when somebody questions him, he makes sure to investigate and to confirm. Right? I mean after all, who's questioning him? Abu Ayyub, radiAllahu anhu, someone who has a much greater status than him, greater in age, and then now he's even martyred. So this stayed in his heart. So he didn't just live with that, he went and confirmed. Anytime you are mentioning a hadith or something of the deen and people are not willing to accept it, don't keep forcing it. Say, Inshallah I will confirm and let you know. I will find out. I will check. And look at what he did to check. He traveled all the way to Medina. And traveling at that time was not easy. He traveled all the way to confirm this hadith. Is this correct or am I making this up? Am I mistaken somewhere? Or is this exactly as I reported it? So he traveled all the way to Medina to confirm the hadith. Knowledge requires effort. It requires effort. And that effort is not just limited to listening or reading. No. It means opening the books again and again and again. Asking, consulting, re-listening, re-reading, researching. It requires effort. Knowledge doesn't come easy. So we see on the one hand the effort for the sake of knowledge. Right? Then secondly we see here Itban radiyaAllahu anhu where he is the man of the masjid. Right? Where he was not able to go, he requested the Prophet salallahu alayhi wa sallam to make his house into a musalla. This was not an excuse that he would not go to the masjid. No. Because when the weather was fine, we see that he was still leading his people in the masjid. Once we were traveling somewhere and we knew that one of our close friends, they lived in that area. We didn't have their contact information. We didn't know how to reach out to them. But we wanted to see them. And we were there for only a short time. So what happened, my mom told my brother go to the masjid. Go to the masjid and you'll find him there. And wallah, my brother went to the masjid and he met that individual in that masjid and that's how we met him. Because we know that when he is in any part of the world he will go to the masjid. So if he is living now in a certain area, definitely you will find him in the masjid. Itban min Malik also, you see so many years have gone by. This incident where he went back to find out the hadith from Itban min Malik, this was in year 50 after hijrah. 50 after hijrah. So Itban min Malik must be very old. And many, many years have gone by. If you think about it, the Prophet Sallallahu Alaihi Wasallam how long did he live in Medina? How long? Just 10. So there have been over 40 years since the time when Itban min Malik was leading his people in prayer. Now imagine, over 40 years he is still doing the same thing. He is leading his people in prayer. Consistency. Consistency. Is something that we don't have. We dream a lot and we do very little. We wish we make sandcastles and in reality we do very little. If you do only one thing, please do it with consistency. Do it properly. خذوا ما آتيناكم بقوة. Hold on to what we have given you with قوة. Not lightly. If you hold it with قوة, then you will have something in your life, and you will get somewhere in your life. 40 plus years this great man is leading his people in prayer. And one might think, oh, still doing the same thing? Yes, still doing the same thing. Because leading the prayer is not something small. Is it? It's not something small. It's something very major. Allah Subhanahu wa ta'ala likes deeds which are consistent even if they are what? Small. Our problem is we get bored of the small deeds and we're like, no, I need to move on to something bigger. And then what happens? We leave what we were doing. We just dream about something bigger that we could do which is beyond our reach. We can't even get there. And where are we? Neither here nor there. Nowhere. What have we accomplished? Nothing. What boat are we on? Still dreaming. Seriously. We need to become very realistic. Very, very realistic. Value your time. Value your life. The opportunities that Allah Subhanahu wa ta'ala gives you, take them seriously. Take them seriously. Take them seriously. Then we see here in the hadith of Itban bin Malik that when he mentioned this hadith Abu Ayyub he did not accept it. Why? Why would Abu Ayyub not accept it? Because the statement apparently contradicted other statements that are mentioned in the Quran and Sunnah. The statement is saying that anyone who says La ilaha illallah, then Allah has forbidden the fire on him which apparently seems like the person is never going to go to hell. But we do know that if there is a person who says La ilaha illallah, and if he commits certain sins, then he will be punished in hell fire and eventually removed from there. So this is the reason why Abu Ayyub rejected the hadith. Or this claim that Mahmoud is saying that the Prophet said that. This is the reason why Abu Ayyub was not willing to accept it. However, we can understand this hadith to be that if you look at the text of the hadith, the words of the Prophet that Innallahu qad harrama ala al-naari man qala la ilaha illallah Harrama ala al-naar can also be understood as he has forbidden on the fire, meaning for eternity. Okay? Forbidden on the fire, meaning for eternity. So if a person has said la ilaha illallah, what does that mean? That he will not be in hellfire for eternity. Alright? Meaning once he is purified from his sin, then he will be removed from there. Last hadith, baab al-tattawu'i fil bayt, voluntary prayers at home, because the Prophet, sallallahu alayhi wa sallam, encouraged people to do that. hadathna abdul-a'la ibn hamad hadathna abu haybun an ayyub wa ubaydillah an nafe'in an ibn umar, radiallahu anhumaa qala qala rasulullahi sallallahu alayhi wa sallam he said, the Prophet, sallallahu alayhi wa sallam, said, ij'alu fi buyutikum min salatikum make in your homes some portion of your prayer, meaning perform some of your prayer where? In your house. wa laa tat-takhiduha qubura and do not make them into graveyards. tab'u hu abdul-wahab an ayyub Now, it's the month of Ramadan, sometimes what happens is that a person is not able to go to the masjid for tarawih prayers. In that situation, don't think you don't have to pray at all. You can pray at home also. And if you pray at home, you're making your house into like a masjid. Right? So, keep prayer, the recitation of the Quran, a part of your house. Subhanakallahu wa bihamdik ashaduwa laa ilaha illa anta astaghfiruka wa atubu ilayk wa rahmatullahi wa barakatuhu."}, "podcast_summary": "Summary: The podcast discusses the performance of voluntary prayers in congregation and at home. It highlights the proof of this practice through various hadiths, including the incident of the Prophet (ﷺ) praying in the house of Um Sulaym and Aisha's narration of the Prophet (ﷺ) leading night prayers with the congregation. The podcast also discusses the significance of playing with children and the permissibility of accepting hadith from even a young child if they remember correctly. Finally, it emphasizes the importance of consistency in worship and the encouragement of the Prophet (ﷺ) to perform voluntary prayers at home without turning the houses into graveyards.", "podcast_guest": {"name": "Mahmood bin Rabir al-Ansari", "summary": ""}, "podcast_highlights": "1. Voluntary prayer can be performed in congregation, as proven by the hadith of Anas and Aisha, where they reported the Prophet Muhammad (peace be upon him) performing voluntary prayers in congregation.\n2. The hadith of Mahmood bin Rabee' al-Ansari tells us that it is Juhlasnah (to play) with children, even spitting water on their face as part of playing, is acceptable as long as the intention is for play or blessing the child.\n3. The hadith also emphasizes the importance of seeking knowledge and verifying information. Mahmood traveled to Medina to confirm the hadith and ensure its accuracy.\n4. It is important to remain consistent in our worship and not abandon good deeds, as demonstrated by Itban bin Malik, who led his people in prayer despite being blind and facing difficulties.\n5. The hadith encourages performing voluntary prayers at home, while still upholding the importance of the masjid as a place of gathering and worship."}