{"podcast_details": {"podcast_title": "Sahih Bukhari The Book Of Night Prayers", "episode_title": "Episode-17-Lesson-159-Chapter-36-37-Hadith- 1185-1187", "episode_image": "http://alhudamedia.com/Fh_Podcast/Bukhari-21.png", "episode_transcript": "... Performing voluntary prayers, how? Jama'a'atan in congregation, in a group. Now here, what is meant is all nawaafil, whatever that voluntary prayer may be. Okay? Any voluntary prayer, performing it in congregation, what's the proof of that?... He's saying that Anas and A'isha both reported it,... From the Prophet ﷺ. When did Anas radhiyallahu anhu reported? The hadith of Anas radhiyallahu anhu is the one in which he, in which the Prophet ﷺ visited the house of Umm Sulaym, and he performed the prayer over there, and it was in congregation, it was not felt. And Anas radhiyallahu anhu and another orphan boy, they both formed a row behind the Prophet ﷺ. Okay? So this is reported in Bukhari. So we see that voluntary prayer is being performed in congregation. What is the narration of A'isha radhulah wa anha? That is also mentioned in Bukhari. It was mentioned earlier in the book, where the Prophet ﷺ performed the night prayer, A'isha radhulah wa anha reported that, he performed the night prayer and the people joined him in the night prayer. So these two narrations prove that it is correct to perform voluntary prayer in congregation. Another clear hadith Imam Bukhari mentions, long hadith but very interesting. Hadithina i'zhaq, hadithina yaqoobu'nu ibraheem, hadithina abi, anidni shihabin kala akhbarani mahmoudubnur rabeer il-ansariyu, annahu aqara rasool Allahi sallallahu alaihi wa sallam. So mahmoud bin rabeer, mahmoud bin rabeer al-ansari, he was from the Ansar radhiyallahu anhu, he is reporting that he aqala, aqala, what does aqala mean? That he remembered. Okay? He remembered, he remembered the Prophet ﷺ. What does it mean by this? He remembered him. Mahmoud radhiyallahu anhu was a very little boy, very little boy, when he met the Prophet ﷺ. He was from Medina but he was of the little children of Medina. Okay? And wa aqala, and he specifically remembered madjatan, the madja. Madja is to take water in one's mouth and then spit it out. This is a madja. Okay? To spit water out of one's mouth. Okay? So he remembered the madja, that madja hafiwajheehi, that the Prophet ﷺ spat, alright, where feewajeehi in his face, min bi'rin, and that water was taken from a well, cannot feed arihim that was in their house. Okay? Now, Mahmoud bin Rabir was 5 years old, very little boy. When the Prophet ﷺ came to his house, there was a well in their house, the water was taken out of there. And as this hadith is mentioned earlier in Kitab ul-il, Imam Bukhari mentions it in greater detail in Kitab ul-il. And we learned that the Prophet ﷺ, he sprayed some water on the face of this little boy, Mahmoud. Okay? Why would he do that? There's different reasons that are given by the ulama. Okay? One reason is play. Okay? Has it ever happened with you that you're doing something and little children that just come and start staring at you? Right? They just come and watch you, like do everything? Right? So what happens at that time? Even if you don't know those children, you play along. Isn't it? You play along. And the way you would play with them will be according to your culture. Isn't it? What might be acceptable in your culture might not be acceptable in another culture at all. Right? Recently, I was at a grocery store and this little boy was with me. And this boy, he's lived majority of his life in another country. So he's still not... I mean, yes, he is Canadian, but he's not fully Canadian. You know what I mean? So this little kid, this boy, he's standing and there's a little baby in a cart. Right? This little baby is staring at this boy. Right? So this boy starts playing with that little baby, going a little too close to that baby. Right? And I'm like, okay, you don't do that here. You know? But he kept doing that. You know, he was going very close to the baby and the mother was like looking and kind of smiling, but you could tell from her face that she was a little uncomfortable. That why is this kid coming so close to my child? Right? So she pushed the trolley away and... So the point is that for this kid, it was something very normal. Right? He had no concept of personal space. Right? But for other people, it's like I need, you know, you have to respect our personal space. You can smile at me from a distance, but you can't come very close to me. Right? If you go to some other parts of the world, people will, you know, randomly touch your baby, pick him up, start kissing him on his cheek. Oh my God. They will literally, you know, kiss your baby on the cheek. Right? And you will see the lipstick marks on the cheek and you're like, I don't know you. I don't know what you've had and what's in your body. You're putting your germs on my child's skin. Right? For example, people have different ways. Right? So you might feel uncomfortable with one way, manner of playing and other people might be perfectly cool with it. Right? So the Prophet ﷺ, he was doing wudu perhaps, he was washing up and he took a mouthful of water and he sprayed it on the face of Mahmoud. Alright? RadhiAllahu anhu. He was playing with him. This is one explanation. Another explanation that Ullama had given is that the Prophet ﷺ did this for tabarruk. To kind of bless the boy. Okay? Because remember that the Prophet ﷺ, I mean his body was blessed. Right? And there's numerous proofs of that. The Sahaba would, you know, even value his sweat. Right? It was his body. A blessed body. So this was for the purpose of tabarruk. Alright? Now Mahmoud, RadhiAllahu anhu, he was only 5 years old when this incident happened. Okay? And here, it is mentioned that he remembered this. He remembered this. And based on this narration, the scholars say, that you can accept hadith from even a child. Okay? Because he is narrating this incident about the life of the Prophet ﷺ when he was how old? Only 5 years old. Right? 5 years old. So as long as a person, as a child can remember correctly, okay? It doesn't matter how old or young they are. Okay? It's not the age that matters. It is the knowledge that matters. Alright? So he was 5 years old when this incident happened and he reported this and it was accepted from him. So anyway, Mahmoud bin Ar-Rabir al-Ansari, Fazama, he claimed, he said, Fazama al-Mahmoudun, and Mahmoud said that أننه سميا عطبان أبن المالكن الأنصري That he heard, أطبان بن مالك الأنصري رضي الله عنه وكان ممن شهد بدران And أطبان بن مالك was of those people who had witnessed Badr, مر أصول الله سلا الله عليه وسلام with the Prophet سلا الله عليه وسلام. So he said that he heard from أطبان بن مالك, يقولو that he said, كنت أصلي لقومي ببني سلام. So what's happening over here? أمحمود heard from who? أطبان من مالك. Who's أطبان من مالك? He's of those companions who participated in Badr. And أطبان رضي الله عنه is narrating that I used to pray for my people amongst the بنو سلام, meaning I used to lead them in prayer, وكان يحرو بيني وبينهم وادن. And there was a valley between me and them, meaning between my house and the rest of the houses of بنو سلام, there was a valley. إضا جاء أطل أمتارو when the rains would come, meaning when there would be a lot of rainfall, فيأشقو عليج تيأزوه. It would be difficult for me to cross that valley, قبل مصجدهم towards there, مصجب. So why would it be difficult? Because that valley would get flooded. فجية ترسول الله سلاله عليه وسلام. So I came to the Prophet صلاله عليه وسلام فقل تله, and I said to him, that إني أنكرت بسري, my vision is going bad, meaning I no longer see very clearly. وإن الوادي الله بيني وبينقومي and the valley which is between me and my people, يصيلو, it gets flooded. إضا جاء أطل أمتار when there is a lot of rain, فيأشقو عليج تيأزوه. Then it is difficult for me to cross the valley. So in other words he's saying, I cannot pray in congregation then, when it rains. فوديت أنكتت فتوصلم بيتي. So I really want that you come and pray in my house, مكانا, in a place, أتخله مصلا, which I can take as a prayer place. I really want you to come to my house and pray, so that I can make that place, where you pray as my مصلا. فقل أصور الله سلاله عليه وسلام سافعلو. So the Prophet صلاله عليه وسلام said, سافعلو, I will do that. He did not refuse. فغدا عليي رسود الله سلاله عليه وسلام و أبوبقريم. So اطبان is saying that, the Prophet صلاله عليه وسلام came in the morning, he came, and with him, أبوبقر رضي الله عنه also came. When بعرد مشتد دناهار, after the day had fully risen, after it had become intense, meaning the daylight had settled, it was daytime. So this is around Duhat time. When he came, فصدا دنا رسود الله سلاله عليه وسلام, the Prophet صلاله عليه وسلام asked for permission. Permission for what? To enter his house. فأذنت الله, so I allowed him. And when he came in, فلام يجلس, he did not sit down, هطقال until he said, أينة حبوأن أسليا مم بيتك, where do you want me to pray in your house? Notice something? When he walked in, he did not sit down until he inquired about where he should pray. Because he came for the salah, right? He didn't come to chill. He came to pray. So he was focused on his purpose. And this is something very important that we need to remember also. We go for one thing, and we get distracted. We go to the masjid to pray, we don't even pray. We get distracted. We go to a class, and we're not even sitting in class. Distracted. Remember why you have taken the time out, sacrificed, left so many things, and come to a place you did not come there to chill. You did not come there to daydream. You did not come there to kill your time. You came there for a purpose. So fulfill that purpose and then do other things. Then do other things. And I know that as students sometimes you have many distractions. You have your phone, you have other people, other people are coming in, you want to talk, you want to see what's happening. No. Everything else is secondary. Everything else is secondary. And if you keep getting distracted by this person and that person, by this thing and that thing, you'll never accomplish anything. I don't know how many of you can even think about taking a test when you have not studied the entire chapter or when you have not attended the entire class. I don't know how you can do that. I never did that as a student. Never. I still don't do it. Anytime I'm taking a class, I want to make sure that I have studied, I have read, cover to cover, I have listened to the lecture, beginning to end. We have such a casual attitude. We listen to some part, miss some other part, coming late to class, leaving early, going in the middle, why? How long is the class? An hour 15 minutes maximum? And if we're spending 10 minutes in the bathroom, what are we doing? If we're spending 10 minutes attending a phone call, we're leaving something that we came for. This is injustice to yourself. You're being unfair to yourself where you're coming to seek knowledge and instead of studying, you're busy with other things. Be fair to yourself. Be good to yourself. So the Prophet ﷺ did not sit down until he asked, where do you want me to pray? So what happened? فَأَشَرْتُولَهُ إِلَّ المَكَانَ So I pointed him to the place, اللَّدِ أُحِبُوانُ أصَلِّ يَفِيهِ in which I wanted him to pray. Look at the Prophet ﷺ also. He's not saying, well, I can pray wherever I want. No. He's asking him, where would you like me to pray? فَقَامَرَصُرُ اللَّهِ صَلَّلَّهُ عَلِّ وَسَلَّمْ So the Prophet ﷺ stood, فَكَبَرَّ He said that the خِبِيرُ وَصَفَفْنَ وَرَعَهُ and we formed rows behind him. فَصَلَّ رَكَعَتَينَ Then he performed two raka'at. فُمْمَ سَلَّمَّ Then he said that the سَلِمْ وَسَلَّمْنَ And we also said that the سَلِمْ حِينَ سَلَمَّ when he said that the سَلِمْ So this is the part which proves to us that it is to perform voluntary prayers in congregation whenever there is a need. So the Prophet ﷺ led the prayer, بُبَكَرَ دَلَّهُ عَنْهُ إِطْبَانُ مَالِّّّهُ and whoever else was there prayed behind him. And notice also that the Prophet ﷺ said the salaam and we said the salaam when he said the salaam. Not when we wanted to say the salaam. Because imam is to be followed. So when the imam says, Allahu Akbar, what are we supposed to do? Let me complete my surah? Hmm? No. You stop where you are and you join. You follow. So even when he is saying the salaam, you have to stop what you are saying and say the salaam. Now what happened? Salah is done. Right? The work for which the Prophet ﷺ came is done. Right? So now once the work is done, can we chill? Yes, we can. So what happened? عِطْبَانُ مَالِّهُ عَلِكَ said, فَحَبَاصْتُهُ So I kept him. حَبْسْ means to retain something, to keep it. Right? So he said, I kept him, meaning I did not let him go. I insisted that he should stay. For what? عَلَى خَزِيرً For? خَزِيرً خَزِيرً is a stew. Right? Some food in which there is meat, there is gravy or there is soup in it also. So for some خَزِيرً يُسْنَ أُولَهُ which had been prepared for him. Interesting, huh? He called him to pray, but he also had food prepared. Okay? And this is of the noble qualities that when somebody is coming to your place, then you serve them some food. Right? إِبْرَاهِمْ عَلِى السَّلَّمْ Did he prepare food for the guests who came? Hmm? Suddenly those guests came, so he went and brought roasted meat. Right? So here also, يُسْنَ أُولَهُ that food was especially prepared for him, سَلَّلَّهُ عَلِى السَّلَّمْ So what happened? The Prophet سَلَّلَّهُ عَلِى السَّلَّمْ agreed. He stayed for the food. And then, فَسَمِعَ أَحْلُودَارِ رَسُولَّ اللَّهِ سَلَّلَّهُ عَلِى السَّلَّمْ فِبَيْتِ So the people of the dar, the house, the people of the house, meaning in the surrounding area, where the Banu Salim, they used to live in this area, right? So in the Banu Salim, they found out that the Prophet سَلَّلَّهُ عَلِى السَّلَّمْ was in my house, in the house of Ithban. What happened? فَظَابَرِ جَالُمْ مِنْهُمْ So the men amongst them started coming. Okay, they gathered. هَتَّكَثُورَ جِالُّفِ البَيْطِ Until there were so many men in my house. Too many men, too many people. They heard the Prophet سَلَّلَّهُ عَلِى السَّلَّمْ is here, so they all came. And then they're all talking, they're eating. فَقَالَ رَجِلُمْ مِنْهُمْ So a man amongst them said, مَفَعَلَى مَالِكُنْ لَا أَرَّهُوا What did Malik do? Where is Malik? I don't see him. Where did he go? فَقَالَ رَجِلُمْ مِنْهُمْ So another man amongst them, he said, ذَكَمُونَّافِكُ He's a munafiq, he's a hypocrite. لَا يُحِبُ اللَّهُ وَرَسُولًا He does not love Allah and his messenger. That's why he's not here. Because if he was really a believer and if he loved Allah and his messenger, then he would be present in this gathering. فَقَالَ رَجِلُمْ لَا حِسَلَّ اللَّهُ عَلَيْهِ وَسَلَّمْ So the Prophet said, لَا تَقُولُ ذَكَّ Do not say that. أَلَا تَرَّهُ Did you not see him? قَالَّا لَا إِلَاهَ إِلَّ اللَّهُ He has said لَا إِلَاهَ إِلَّ اللَّهُ يَبْتَرِ بِذَالِكَ وَجْهَ اللَّهُ And he wanted by that the face of Allah, meaning he said the kalima seeking who? Seeking Allah. فقَالَّا So that man, he said, Allahu rasoolahu alam Allah and his messenger know best. Allah and his messenger know best as to who that man is, whether he's really a believer or a hypocrite. أما نحنو As for us, فَوَ اللَّهِ لَا نَرَّ وَدَهُ Then by Allah, we do not see his love, وَلَّهَ حَدِثَهُ nor his speech, لَّا إِلَّا المُنَا فِقِينَ except that it is directed to the hypocrites. We have seen him loving the hypocrites and talking with the hypocrites a lot. That's what we have seen. He hangs out with them. So this is why we think that he is one of them. قَالَرَّ سُلُ اللَّهِ صَلَّ اللَّهُ عَلِّهُ صَلَّامٍ The Prophet said, فَإِنَ اللَّهَ قَدَحَرَمَ عَلَّنَّا Indeed, Allah has forbidden on the fire, مَنْ قَالَّا لَّا إِلَّهَ إِلَّهُ Whoever says, لَّا إِلَّا حَيلَّهُ إِلَّهُ then such a person is forbidden on the fire, يَبْتَرِ بِدَالِكَ وَجْهَ اللَّهِ If he says, لَّا إِلَّا حَيلَّهُ إِلَّهُ while seeking by that the face of Allah. Meaning he says it with sincerity, then this person will be forbidden on hellfire. Now what do we see here? This was a very big claim to make in front of the Prophet ﷺ, right? That that man is a hypocrite, he does not like Allah and his messenger. In fact, it's almost rude. Imagine somebody telling you on your face, he doesn't like you, she doesn't like you. It's insulting, it's hurtful. It's like, okay, they don't like me, but you don't have to tell me. But what did they say? They said, this man said, this man is a hypocrite, he does not like Allah and his messenger. And he's saying this to the messenger, سلى الله عليه سلم. So it's disrespectful also. It's a big claim and it's also disrespectful. So what happened? The Prophet ﷺ was very wise, right? He would always put things where they belong. So he corrected the people that don't make such a claim. Now, قال محمودى, محمود who heard this hadith from عيتبان, right? And he narrated this hadith. What happened? محمود said, فحدصته هومن, I narrated this hadith to different people. Because it's a very interesting incident, right? I mean, the Prophet ﷺ is coming to somebody's house first. There's a blind man who has an issue with his vision, not able to go to the masjid, the Prophet ﷺ is going to his house. Praying there. There's so much to learn from this incident. So he said, I narrated this hadith to a people, فيهم أبو أيوب. And amongst those people was also Abu Ayyub. Who is Abu Ayyub? سهب رصول الله سلا الله عليه وسلام أفي غزواته. The companion, سهب رصول الله سلا الله عليه وسلام, he was a companion of the Prophet سلا الله عليه وسلام. This is Abu Ayyub Al-Ansari, right? The companion in whose house the Prophet سلا الله عليه وسلام stayed, when he arrived in Medina. So he said, I mentioned this hadith to Abu Ayyub, رضله عنه وسلام أنه. When فيهم أزواته in his battle, الله توف يفيه in which he died. The battle in which Abu Ayyub died, is the same battle in which I had mentioned this hadith to him. Okay? Which was this battle? ويزد ببن معوية عليهم. يزد بن معوية was their leader. This is after who? The time of Abu Bakr? The time of Umar? The time of Uthman رضله عليه وسلام. Alright? Because after that we see that معوية رضله عليه وسلام who he had appointed his son, as a leader of many expeditions and then later, Yazid also became the Khalifa. So anyway, this was a battle in which Yazid was their leader, بيعرد الروم and this was a battle in the land of Rome. Now, محمود narrated this hadith to Abu Ayyub. When? When? In a battle. Okay? In a battle. And later in that same battle Abu Ayyub died. Right? He was killed. Now, interesting thing is that they're gone for a battle. It doesn't mean that the battle is, you know, going on at that time. But during this incident, they're reporting hadith to one another. That is beautiful. Right? That they're reporting hadith to one another even at a time of battle. Now what happened when he reported this hadith to Abu Ayyub, فأن كره عليى أبو عيوب أبو عيوب rejected me. He said, قاله سدو الله مأذن الرصول الله سلا الله عليه و سلام خالى ما قلتى قتوب. He said, بيعلا, I don't think the Prophet سلا الله عليه و سلام ever said what you're saying he said. What? That if a person says, لا إلاه إلا الله sincerely then the fire is forbidden on him. Abu Ayyub says, there's no way the Prophet سلا الله عليه و سلام could have said that. فكبر ذذليك عليه So, I made a promise with Allah that in salamani that if Allah would protect me, meaning if I survive the battle, هطا أكفلا من غزواتي that I leave the battle fine, أس ألا أنها إطبان بن ما عليه هن رضي الله عنه that I will go and ask إطبان من ما عليه رضي الله عنه. إن وجطه حين, if I were to find him alive, في مصد خومه in the masjid of his people. So, he made a commitment. He said, if I survive this battle, I'm gonna go to the masjid of إطبان ما عليه. I'm gonna find him. If he's alive, I'm gonna ask him about this hadith again. So, what happened? فقفلت So, I returned. فأحللت بحجتن أوب أمراتن. And I made the talbiyyah for Hajj or Umrah. He put on the ihram. Because if you're going all the way to Medina, from the land of Rome, you might as well do Umrah or Hajj. Right? هصم مصرت حتقدم تل مدينة. He said, then I traveled until I reached Medina. فأطيت بني سلم. He said, I came to the Banu Salim, where they used to live. فإذار إطبان شيخون. He said, there was Ṭibān رضيله عنه, شيخون, an old man, ʾAʾmā, who had become completely blind now, يُسللي لقومه. And he was still leading his people in prayer. That's what he found him doing. فلم مصلم عمن الصلا. Then when he said that the Salim from the Salah, he ended the prayer, سلم تعليه, I greeted him. وأخبر ته من عنا. And I told him about who I was. Why? Because now, Ṭibān was old and he was blind. So, Mahmud introduced himself, reminded him of who he was. سم مصألت حضالك الحديز. And then I asked him about that Hadith. فحدذنيه كما حدذنيه أولمرة. So he narrated that Hadith to me, just as he narrated it to me the first time. So what do we see here? Too many things. Firstly, we see that Mahmud, when somebody questions him, he makes sure to investigate and to confirm. Right? I mean after all, who's questioning him? Abu Ayyub, رضي الله عنه. Someone who of a much greater status than him. Greater in age. And then now he's even martyred. So this stayed in his heart. So he didn't just live with that, he went and confirmed. Anytime you're mentioning a Hadith or something of the Deen, and people are not willing to accept it, don't keep forcing it. Say InshaAllah, I will confirm and let you know. I will find out. I will check. And look at what he did to check. He traveled all the way to Medina. And traveling at that time was not easy. He traveled all the way to confirm this Hadith. Is this correct? Or am I making this up? Am I mistaken somewhere? Or is this exactly as I reported it? So he traveled all the way to Medina to confirm the Hadith. Knowledge requires effort. It requires effort. And that effort is not just limited to listening or reading. No. It means opening the books again and again and again. Asking, consulting, re-listening, re-reading, researching. It requires effort. Knowledge doesn't come easy. So we see on the one hand, the effort for the sake of knowledge. Right? Then secondly we see here, it's ban radhiyallahu anhu, where he is the man of the masjid. Right? Where he was not able to go, he requested the Prophet ﷺ to make his house into a musalla. This was not an excuse that he would not go to the masjid. No. Because when the weather was fine, we see that he was still leading his people in the masjid. Once we were traveling somewhere, and we knew that one of our close friends, they lived in that area. We didn't have their contact information, we didn't know how to reach out to them, but we wanted to see them. We were there for only a short time. So what happened, my mom told my brother, go to the masjid. Go to the masjid, and you'll find him there. And walla, my brother went to the masjid, and he met that individual in that masjid, and that's how we met him. Because we know, that when he is in any part of the world, he will go to the masjid. So if he is living now in a certain area, definitely you will find him in the masjid. Uthbaan bin Malik also, you see so many years have gone by. This incident, where he went back to find out the hadith from Uthbaan bin Malik, this was in year 50 after Hijrah. 50 after Hijrah. Okay. So Uthbaan bin Malik must be very old. And many, many years have gone by. If you think about it, the Prophet ﷺ, how long did he live in Medina? How long? Just 10, right? So there have been over 40 years, since the time when Uthbaan bin Malik was leading his people in prayer. Now imagine, over 40 years, he's still doing the same thing. He's leading his people in prayer. Consistency. Consistency. It's something that we don't have. We dream a lot and we do very little. We wish we make sandcastles, and in reality we do very little. If you do only one thing, please do it with consistency. Do it properly. هُذُومَا أَطَيْنَّاكُمْ بِقُوَّا Hold on to what we have given you with قُوَّا. Not lightly. If you hold it with قُوَّا, then you will have something in your life, then you'll get somewhere in your life. 40 plus years, this great man is leading his people in prayer. And one might think, oh, still doing the same thing? Yes, still doing the same thing. Because leading the prayer is not something small. Is it? It's not something small. It's something very major. Allah subhanahu wa ta'ala likes deeds which are consistent even if they are... What? Small. Our problem is, we get bored of the small deeds, and we're like, no, I need to move on to something bigger. And then what happens? We leave what we were doing. We just dream about something bigger that we could do, which is beyond our reach. We can't even get there. And where are we? Neither here nor there. Nowhere. What have we accomplished? Nothing. What boat are we on? Still dreaming. Seriously. We need to become very realistic. Very, very realistic. Value your time, value your life. The opportunities that Allah subhanahu wa ta'ala gives you, take them seriously. Take them seriously. Then we see here in the hadith of Ithban bin Malik radhiallahu anhu, that when he mentioned this hadith Abu Ayub radhiallahu anhu, he did not accept it. Why? Why would Abu Ayub not accept it? Because the text, the statement, apparently contradicted other statements that are mentioned in the Quran and Sunnah. Okay? The statement is saying that anyone who says, لا إلاه إلا الله, that Allah has forbidden the fire on him, which apparently seems like the person is never going to go to hell. Right? But we do know that if there is a person who says لا إلاه إلا الله, and if he commits certain sins, then he will be punished in hellfire and eventually removed from there. So this is the reason why Abu Ayub rejected the hadith. Alright? Or this claim that Mahmoud is saying that the Prophet ﷺ said that. Alright? This is the reason why Abu Ayub radhiallahu anhu was not willing to accept it. Okay? However, we can understand this hadith to be that if you look at the text of the hadith, the words of the Prophet ﷺ, that إن الله قد حرم على ناري من قال لا إلاه إلا الله. حرم على على نار can also be understood as that he has forbidden on the fire meaning for eternity. Okay? Forbidden on the fire meaning for eternity. So if a person has said لا إلاه إلا الله, what does that mean? That he will not be in hellfire for eternity. Alright? Meaning once he is purified from his sin, then he will be removed from there. Last hadith, باب أتطور إف البيد Voluntary prayers at home because the Prophet ﷺ encouraged people to do that. حدثن عبد العرلب نوحماد حدثن بوهابن عن أيوب وربيد الله أنا فرن عنبن عمر رد الله عنهما. قالقر رسول الله سلا الله علي وسلام, he said the Prophet ﷺ said, إجعلو في بويو تكم من سلا تكم. Make in your homes some portion of your prayer. Meaning perform some of your prayer where? In your house. والا تخد حقبورا. And do not make them into graveyards. تبرغو عبد الوهاب عن أيوب. Now it's the month of Ramadan, sometimes what happens is that a person is not able to go to the masjid for taweeh prayers. In that situation don't think you don't have to pray at all. You can pray at home also. And if you pray at home, you're making your house into like a masjid. So keep prayer, the recitation of the Quran, a part of your house. سبحان كلاهم و بحمدك أشدو الله إلا إلا أنتا. أستقل قوأأتوب إلايك. سبحان كل أصدواهم و رحمد أله و بركاتوها."}, "podcast_summary": "The podcast discusses the importance of performing voluntary prayers in congregation. The speaker refers to the narrations of Anas and Aisha reporting that the Prophet ﷺ performed voluntary prayers in congregation. Another hadith narrated by Mahmoud bin Rabia mentions the incident of the Prophet ﷺ visiting his house and performing prayers there. The podcast also highlights the significance of performing voluntary prayers in congregation and the acceptability of narrations even from a child. The podcast concludes with a discussion on the consistency and effort required in religious practices.", "podcast_eminent_personality_name": {"name": "Mahmoud bin Rabir al-Ansari", "link": "", "bio": ""}, "podcast_highlights": "In this podcast, the key topics discussed include:\n\n- Performing voluntary prayers in congregation (00:49)\n- The proof from the hadith of Anas and Aisha that voluntary prayers can be performed in congregation (01:04)\n- The hadith of Mahmoud bin Rabia, a young companion, who remembered the Prophet (PBUH) spitting water on his face (02:50)\n- The permissibility of accepting hadith from children (03:57)\n- The incident of the Prophet (PBUH) praying in the house of Ithban (05:32)\n- The Prophet (PBUH) fulfilling the request of Ithban to pray in his house (06:40)\n- The Prophet's (PBUH) instruction to say the salaam when he says the salaam (08:01)\n- Discussion among the people about one companion being a hypocrite (09:28)\n- The Prophet's (PBUH) response to such claims (11:10)\n- The importance of not making claims about the faith of others (12:12)\n- The effort of Mahmoud to confirm the hadith by traveling to meet Ithban again (14:06)\n- The consistency of Ithban in leading his people in prayer for over 40 years (15:00)\n- Abu Ayyub's initial rejection of the hadith due to apparent contradiction (17:55)\n- The understanding of the forbidden on the fire to mean for eternity (18:40)\n- The encouragement to perform some prayer in one's home (19:27)\n- The reminder to not make homes into graveyards by neglecting prayer (20:12)"}