{"podcast_details": {"podcast_title": "CyberWire Daily", "episode_title": "Luke Vander Linden: With age comes knowledge. [VP] [Career Notes]", "episode_image": "https://megaphone.imgix.net/podcasts/58ab7ae0-def8-11ea-b34c-b35b208b0539/image/dp.jpg?ixlib=rails-4.3.1&max-w=3000&max-h=3000&fit=crop&auto=format,compress", "episode_transcript": " You're listening to the CyberWire Network powered by N2K. Hi there. Sam Meisenberg from N2K here inviting you to join me for a brand new monthly segment that you can find right here in the CyberWire Daily called Learning Layer. Cybersecurity is a constantly changing field and you need to evolve with it. That means you'll need to acquire new skills and new knowledge. Join me as we learn how to learn in the cybersecurity space. On Learning Layer, we'll be chatting about everything from how to improve technical skills through certification exam prep to brain science. Happy learning. I'll see you in the layer. Are you frustrated with cyber risk scores backed by mysterious data, zero context and cloudy reasoning? Typical cyber ratings are ineffective and the true risk story is begging to be told. It's time to cut the BS. BlackKite believes in seeing the full picture with more than a score, one where companies have complete clarity in their third party cyber risk using reliable quantitative data. Make better decisions. Reduce your uncertainty. Trust BlackKite. My name is Luke Vanderlinden and I am the vice president of membership and marketing for the retail and hospitality ISAC and host of the RH ISAC podcast here on the CyberWire network. I wanted to be a television producer. It was not a cybersecurity professional because that career, that possibility didn't even exist. I wanted to work in the broadcasting industry and be a Hollywood mogul. My first career, by the way, was in 1977. I became a child model and actor. It might have been a little bit inspired by my flirtation with the industry at an early age. But yeah, I majored in media studies when I went to college, basically the business behind television. While I was in college, I got a job at the local PBS station where I was living and that turned into the first 11 or so years of my career working in television. It was PBS though, so it wasn't exactly in production or as a Hollywood mogul, but swiftly became part of their fundraising apparatus and their membership apparatus. That's what I did. I ran those for a while. I also created the online fundraising initiative for that station that was then emulated at the time by a number of other stations. Early on, that was my claim to fame. As the internet was starting to be a thing, we learned how to use it and use it to market and to raise money for our initiatives. Yeah, so that's how I fell into, I guess we'll call it, back then I was doing basically direct response marketing. Using email, back then that was the best tool we had, but then that would turn into social media and then various other tools. Interestingly, after I progressed through various stages in the fundraising departments at that station, I ended up going from new media, email and online, to old media. That turned into a job working in direct mail, but it was really using any tool to reach out to people to get them to take the action you want them to take. I worked at an agency, a small family-owned agency for about seven years after I left the station, working with a lot of public broadcasting stations, but then branching out to other areas like public libraries, advocacy groups. That got me interested in working with individuals who support organizations and who are active involved with organizations. I ultimately fell into the association world, which is technically what the RHI SAC really is. I wear two hats, well three hats if you count the podcast hat, but we'll leave that one aside. Two hats really is the care and feeding of our members. Everything from when someone wants to join, us making that happen, to just onboarding them once they do join, checking in, make sure they're getting as much out of their membership as we can. The big part of my day is taken up with interacting with and having calls with our members and prospective members. The other hat I wear is I'm part of a leadership team. Just looking at the overall strategic direction of the organization, are we serving our members from that higher altitude vantage point and making plans for six months to a year to five years in the future. It's really great to be able to be on the ground and also up in the air doing both things, those strategic and tactical functions. I'm proud of the way I work with... I have a great team for direct reports, they're amazing. I think for us internally it's important, and I think the other members of the leadership team feel this way, to have a fair amount of transparency. We work with people who secrecy and non-disclosure and keeping things quiet is a key, key part of the job, but we also run a sharing community. Just as we want our members to feel free to share with each other on our sharing platforms, we want our staff to be open with each other. We're also entirely remote. For us to create that corporate culture when you're not running into people at the water cooler or smelling someone's fish leftovers that they're heating up in the microwave from the day before, or having that office space type cubicle culture is important too. I think we've done a great job building a transparent and great corporate culture even though we're flung all over the country. There's a skills gap, obviously. There's a huge number of open positions, and how do you fill them? Talking to people, I'm interested in that, but I'm not technical. It's absolutely true. As long as you have a willingness to learn, an interest, a passion about this topic, you can learn the skills. Not all roles are technical. I've picked up a lot. It's great if you come with, in my opinion this is key, a good level of security awareness. But again, you don't have to be technical. You can go in and have a passion for it, have a passion for learning. You can learn the technical skills if those are required for the job. When I worked for that small family-owned business, the president and founder of the company once said to me, an expert is someone who's done something once. So every experience that you have is so valuable even if you fail because you can learn something from it. This is only the third job where I've had direct reports, but I love managing people just as one example, but I've learned from the mistakes that I've made and from the way I've interacted with direct reports in the past. I think I'm good at it now. I think with age comes this knowledge, but also with experiences. To that point, don't be afraid to go out there and fail. Give it a shot. I think that's one of the best ways to be successful is not to be afraid to fail, but to go out and give it a shot and learn from what you've done. If you think about the largest retailers who are our members and the number of consumers that they're able to protect because of their membership with us, it's just an organization that no one's heard of. They don't need to hear about us. They don't need to know we exist unless you work in this industry. To me, I don't need my name to be known, but the sheer impact this organization has is so great that to me, that's just a great legacy to have. And now a word from our sponsor, Cintiatt. As an 8A hub zone minority and women owned small business company, Cintiatt specializes not only in software engineering, but in artificial intelligence and cybersecurity as well. Cintiatt's customers and they retain those customers include the US Department of Defense, the intelligence community, and the departments of state and justice. Their mission is to protect the systems that protect the people who protect us. If you're looking for a partner in accomplishing your mission, check out Cintiatt.com. That's C-I-N-T-E-O-T dot com. Your partners in everything data and cybersecurity."}, "podcast_summary": "This podcast explores the career journey of Luke Vanderlinden, the Vice President of Membership and Marketing for the Retail and Hospitality ISAC. Luke shares his background in broadcast media and fundraising, and how he transitioned into the cybersecurity field. He emphasizes that a willingness to learn, passion, and security awareness are more important than technical skills. Luke also highlights the importance of embracing failure as a learning opportunity and the satisfaction of working for an organization that has a significant impact, even if it goes unnoticed by the general public. The podcast concludes with a sponsor message from Cintiatt, a company specializing in software engineering, artificial intelligence, and cybersecurity.", "podcast_guest": {"name": "Luke Vanderlinden", "summary": ""}, "podcast_highlights": "Here are 5 key moments from the podcast:\n\n1. Luke Vanderlinden's background in the broadcasting industry and his transition into cybersecurity.\n2. The evolution of marketing and fundraising initiatives in the age of the internet and social media.\n3. Luke Vanderlinden's experience in direct mail and using various tools to engage with people.\n4. The importance of transparency and corporate culture in a remote work environment.\n5. The discussion on the skills gap in cybersecurity and the importance of having a passion for learning and willingness to adapt."}