{"podcast_details": {"podcast_title": "Sahih Bukhari The Book Of Zakat", "episode_title": "Episode-35-Lesson-205-Chapter-75-78-Hadith-1508-1512", "episode_image": "http://alhudamedia.com/Fh_Podcast/Bukhari-Zakat.png", "episode_transcript": " باب سارم بن زبيبن سدقة الفيطر can be given in the form of a sour of raisins. حدثنا عبد الله بن منيرن سمي عيزيد الأذانيية حدثنا سفيانو عنزيد بن أسلما قلا حدثني عياد بن أبدلاه إبن أبي سرحن أن أبي سريد إن الخدريي رضي الله عنه Abu Sa'id radhiAllahu anhu reported that Qala he said, قنا نرقيه فيزمان بيسل الله عليه وسلم أصارم طعمن We used to give it, meaning zakatul fitr, in the time of the Prophet صله عليه وسلم a sour of food, أوصارم تمرن or sour of dates, أوصارم شرير or sour of barley, أوصارم طبيب or a sour of raisins. فلم بجا موعوية توط so when mawiyya came, وجا أتسمراعو and Syrian wheat came, Samra is Syrian wheat, wheat that is from Syria. Qala he said, أرا مدم منهاذ that I see that it is a mud of this, ياردل مدضاني and he has made it to mud. So basically Abu Sa'id al-Khadri radhiAllahu anhu opposed mawiyya radhiAllahu anhu in this matter. He said basically that it doesn't matter what the value is, what matters is the volume and he said that at the time of the Prophet صلى الله عليه وسلم we always gave one sour, so it has to be one sour. Now there is a question, can you give money in place of food? Because we see that in this hadith it's very clear, it's one sour of food. So can you give money in place of food? I mean didn't money exist at the time of the Prophet صلى الله عليه وسلم? Did, right? But people give money to the poor, they go buy your own food? What did they do? They were supposed to give food, right? So technically you're only supposed to give food. Because you see one is that you give money to a poor person. I mean you're making things harder for them. They have to go buy the food and then bring it. If you give them food you're making things so much easier for them, correct? Secondly, some people have this bad habit if they're given money for food, they won't use it for food. They won't spend it on the needs of their family, they will spend it on something else. So their children will go hungry but they will still fulfill their wishes. So the point is that no one should be hungry on Eid day. So it is food that should be given to the poor. Meaning what the poor should receive is what? Food. What you should give is what? Food. Technically it's supposed to be food. So however the issue is you can't always buy the food and give to the poor. Like for example living over here. You don't even know who to give that food to sometimes. Because people don't want to show that they're in need of charity or Zakat. So you can't always tell who is in need and who is not. Likewise you might want to send food to a place where there's famine. Because people in your community have enough to eat all year round. But you know that in another place where a lot of Muslims live, people are hungry. So you want to send them food over there. Now you can't exactly send them food from here, can you send them money? Yes, that would be easier. So in this case what you can do is you can give money to someone else. That they should buy the food on your behalf with that money and deliver it to the poor. So basically you are asking someone for help here. That help me fulfill my duty. And this is something that we're allowed to do. Even when it comes to slaughtering animals on the other Eid. Eid al-Adha. You can ask someone else to slaughter the animal for you. We learned that the Prophet ﷺ would distribute the animals for slaughtering amongst the companions. At Hajjatul-Wadar he slaughtered 63 camels himself. And then the remaining he gave to Ali radhi allahu anhu to slaughter. So this means that you can seek the help of someone else in giving this charity, in fulfilling this obligation. But remember that money or clothes or something else cannot be a substitute for sadaqatul fitr. You can give money to someone so that they buy food on your behalf and give it to the poor. But you cannot send a money transfer to a poor person. But this is my sadaqatul fitr to you. You understand? Money cannot be given unless the poor person insists that they want money. And you are not able to find anyone to receive food from you. Now some people say that, no, why give food? This person needs money. If I give them money, they will be able to pay their rent, they will be able to pay for their children's education. So why give food? Because you can give money all year round. At this time on Eid day, Allah wants you to give food. And you know people have a similar complaint about Eid al-Adha. Why slaughter animals? Just give charity. You have all year to give money, to give clothes, to give donations, to support someone's education. You can do that. But on that day, Allah wants you to slaughter animals. If you give it to, for example, an organization that will deliver the food to poor people, that's perfectly fine. If you go to a poor person and give him 50 rupees or 100 riyadh or something like that, that is not correct. And that's fine. When you give the fitrah to the masjid, it's understood. The masjid is going to deliver, is going to buy food with that money, or is going to give that money to someone else to buy food and give to the poor. Now remember that giving food on this day for Zakatul Fitr, giving food is what the intention is. The purpose behind this is Zakat. And we discussed the reasons for that earlier. But also remember that giving food, feeding others, this is a shayar of Islam. This is a part of our religion, a symbol of our religion. It's the way of Islam. One of the first things the Prophet ﷺ taught when he came to Medina was what? That spread salam, feed people, also pray in the night and you will enter jannah in peace. This was the first thing the Prophet ﷺ taught when he came to Medina. Akshush salam, atu u'muttaram, wasallu bilayli wa nasuniyam, tatkulul janata, bisalaam. So feeding people is a shayar, it's a symbol of Islam. This is something that we're supposed to do. And when you put a few dollars in a box, that's really not like giving food to someone. And also if we replace sadaqatul fitr with just money, always giving money, then again how will people know that this is a shayar of Islam? There's other cultures, other people whose symbol has become that they have kitchens, soup kitchens. I mean there are so many worship places, even locally they're known for their soup kitchens. Even Muslims will go there to eat. And mashallah that's good, excellent that they're feeding people. But this is a shayar of Islam also, this is something that we need to do also. So we can't replace everything with just money, money, money. That's like almost being lazy. You see if someone were to tell you, here's money, go get the groceries. That's hard. I mean we'd rather buy groceries on Amazon or something. We want things to show up at our doorstep because there is convenience in that. So it's a day of celebration, not of burdening people, but of bringing ease to them. Bab as-sadaqati qabil al-eid. Sadaqatul fitr is given before Eid, meaning before Eid salah. Hadatna Adam, hadatna hab subnu maisala, hadatna musabnu rukba, an-nafairn, anibni umarah radhiyallahu anhu ma, annan nabiya salallahu alayhi was-salama. So Ibn Umarah dillahu anhu reported that the Prophet salallahu alayhi was-salam, amo rabbi zakatul fitr, he instructed regarding zakatul fitr that it should be given qabilah khuru jinnasi ila salah, before the people go out to salah. Meaning it is due before salatul Eid is performed and before people go out for Eid salah. So for example, you are going for a 9 o'clock Eid salah. But already in your city, people have gone out for Eid salah at 6 o'clock, for example. You know, some places they have early Eid salah. So people have already gone out for Eid salah. So you're supposed to have already given your Eid salah before 6 o'clock. So remember that when it comes to the sacrifice on Eid al-Adha, that sacrifice is after Eid salah. You cannot offer that sacrifice before Eid salah. In ahadith we learned that if someone offers the sacrifice before Eid salah, then it is just meat. It is not the official sacrifice. And when it comes to zakatul fitr, then it has to be given before Eid salah. Which means that if you give it after the time, then it will just be charity. It will not be sadaqatul fitr. Which means that you will not get the benefit of sadaqatul fitr, if you don't give it at the right time. So if a person delays it and gives it after salah, then it won't count as fitr. In ahadith we learned, and this is in Muslim, the Prophet said that من عمل عملا عملان ليس عليه أمبرونا فحو عبد That if someone does an action which is not according to our way, then that action won't be accepted. The way of the Prophet is that sadaqatul fitr is given before people go out for Eid salah. So if you give it afterwards, it won't count. I mean because it's an obligation. An obligation means that you have to do it and if you are careless about your obligation, then a person is sinful. Leaving a wajib, leaving a falt is also sinful. In another hadith which is in Sunnah Bidaoud, in the report of Ibn Abbas, we learned that من عداها قبل الصلاتي فهي أزكاتن مقبولةن That whoever gives it before salah, then it is zakat that is accepted. Meaning it is sadaqatul fitr that will be accepted. ومن أداها برد الصلاتي فهي أصضقاتن من الصضقاتن It is just a charity. It will not count as sadaqatul fitr. Now, remember that zakatul fitr becomes obligatory when the sun sets on the last day of Ramadan. So the moon is sighted, Eid is declared, that is the time when zakatul fitr becomes an obligation. Technically that is the time when it becomes obligatory. And the time expires when? When the people go out for? Eid Salah. And Eid Salah is to be performed when? After Ishaq. Not before Ishaq. It cannot be with Fajr. So basically you have time from when? From when the moon is sighted until Ishaq. Technically that is the window. But if you think about it, it is a very small window. I mean especially if you have to go and give the food, buy the food and give it. You know someone mentioned recently about living in a Muslim country for a few years. They were saying about how they experienced things over there which were very beneficial. And I believe in that also that if you at least spend an Eid or two in a place where Muslims live, you can actually practice certain things which you cannot generally practice. So if for example you are in Pakistan let's say for Eid, Eid-ul-Fitr. Technically you can go bring the groceries, keep them at home, keep the atta and the rice and everything. The flour and the rice, whatever it is that you want to give. Moon is sighted, make the packages and at night go deliver them. Go find the poor and give them. So before the morning comes they have the food. And it's not a whole lot of food that you have to give. Isn't it? It's not that much, it's not like you have to take ten bags. You just have to take four handfuls per person. And that can be easily the amount of food that we bring in one grocery trip from Costco. So it's really not that much work. So InshaAllah make it your intention that at least one Eid you want to do this. That within this window InshaAllah you want to give Zakat-ul-Fitr. Technically this is the window. Now of course because it's a very small window, it is allowed to give Zakat-ul-Fitr before this time also. You can give it before this time also. We learned that in a hadith in Sunan-i-Bidaoud that Ibn Umar reported that the Prophet salallahu alayhi wa salam commanded us that at the end of Ramadan when the fasting is done then we should give Zakat-ul-Fitr. And Abdullah ibn Umar used to pay it one or two days before Eid. So Abdullah ibn Umar, what was his habit? He used to give it one or two days before Eid. So you know it's very normal. As Eid is approaching, the end of Ramadan is approaching, people start thinking about what they're going to cook, what they're going to wear. Well that is something that's done way in advance. So you can give it a few days in advance but this doesn't mean that you give it at the beginning of Ramadan. In the last Ashrah, closer to Eid, you can give it. But if you are sending it abroad, like for example you're going to give it to the Masjid, then please be easy on the Masjid people also. If you're giving them Zakat-ul-Fitr a day before Eid, how can they make sure that they find someone in another country who will buy the food and give it on time? How can they make sure? You're putting your Zakat-ul-Fitr at risk. So the moment you find out how much the amount is for that year, and remember that amount is based on what the value of this amount of food would be, then give it as soon as possible. Make it easy for them also. Because they have to ensure that the food is delivered to the poor before Eid-Sala. So it's a burden on them. And if you don't cooperate with them and they don't end up giving Zakat-ul-Fitr on time, then you're missing out. Your obligation is not being fulfilled. So give it before time. And don't give it on the day of Eid. As you're entering into the Masjid, you're putting it in the box. It's too late because the money will fall in the box. But the food will not reach the poor person. Correct? The food is supposed to reach the poor person before people go out to pray. Next hadith... Hadith... Abu Sa'id al-Khadri said that we used to go out in the time of the Prophet on the day of Fitr. We would take out, meaning we would give. We would give on the day of Fitr a sa'ar of food. Waqar Abu Sa'idin wa kana ta'amana ash-shairu wa zabibu wal-aqitu wa tamru And he said our food in that time was barley, raisins, cheese or dates. So one thing we learned from the wording is our food was this and this. So a person is to give Fitr in the form of the food that they typically eat themselves. It is Sa'am min ta'am. And Abu Sa'id said, wa kana ta'amana. So whatever food a person eats themselves, that is the food that they should give as Fitr. Not that for Fitr you give the no name brand and for yourself you bring the organic. You get the point? It has to be food that you eat, what you eat. I mean that's what we discussed that money existed at the time of the Prophet ﷺ. But they didn't give money to the poor on this day, they gave them food. Now if you are not in that position to deliver the food to the poor, but you can give the money to someone else so that they buy food on your behalf and give to the poor, that is fine. This happens, this happens. I remember in Pakistan once we were going somewhere and a poor person, they were begging for money and somebody with us, they had some food and it was packaged food. And that's expensive in Pakistan. So they gave them that packaged food and he literally threw it. He said, give me money, I don't want this. So if something like that happens and at this time you can't exactly walk away, because now this poor person is depending on you and it's kind of rude to walk away and not give anything. So in that case, okay you can give money, but it would be better that you give food. And then sometimes what happens is that, because poor people know that this is the day when people have to give zakat ul fitr, and now in so many places they have a habit of only taking money, because in so many places people don't give food, they just give money. So if you give them food, they are really not going to be happy. So some are going to insist that you give them money. So in that case, okay you have no other option, but try to find an option to give food so that you can fulfill the sunnah. Now who should zakat ul fitr be given to? Now do you notice that you asked earlier about how is it zakat ul fitr or zakat ul fitr? So fitr is also called zakat, correct? And in so many ahadith we have seen that zakat ul fitr, called ada, zakatah. So basically the word zakat has been used for zakat ul fitr, correct? So based on this, one group of scholars says that zakat ul fitr is to be given to the same people that you give the other zakat to. So those who are eligible for zakat in general are also eligible to receive zakat ul fitr. But others say that no, it is to be given only to the fukara and masaqim, to the poor and the needy, not the workers who are appointed to collect zakat and distribute zakat, alright? Not people in debt unless they have become fukara and masaqim. Because the purpose of zakat ul fitr is what? Feeding. So on this day the poor and those in need should be given food. So this is the thing, zakat ul fitr is to be given and received within this time frame. So if you are giving it locally or you are sending it abroad, you have to make sure that the poor receive this before the time expires. So if that can be arranged locally, I think that would be excellent. And this is something that perhaps we should encourage and maybe even volunteer for this so that an initiative like this can be started over here. InshaAllah we can revive this sunnah because this sunnah is like forgotten almost. People think zakat ul fitr is just $5, $10, right? I mean we don't think it's food. Exactly and people think that it's supposed to be given as you enter the masjid, right? Before salah you go put that $10 in the box. This is so far from the sunnah. So alhamdulillah for knowledge that this is the benefit because people have become very lenient regarding this. You know I have heard this announcement so many times at least in al-hudah that please give your zakat ul fitr, please give your zakat ul fitr on time. And you know Ramadan teaches us to respect those time limits, right? I mean you cannot eat beyond a certain minute, you cannot eat before a certain minute. So this is something that we should respect. May Allah help us all. Okay let's quickly complete this. Saadahat ul fitr ala al-hoori wal mamluq. Saadahat ul fitr is obligatory for both those who are free and the slaves. Waqalaz-zuhriyu fil mamluqina blytijarati. And as zuhri said regarding the mamluq, meaning the slaves which are for trade, that yuzakka fitijara wa yuzakka fil fitri. There will be zakat on the trade and also on the fitr. Basically here what Imam Bukhari is talking about is that saadakat ul fitr is supposed to be given by the free and also the slaves, correct? Now a slave doesn't have money. Who is going to give his zakat, his zakat ul fitr? The master will, technically. So the master is supposed to give zakat ul fitr for the slave that he owns and also for the slave that he is going to sell. You understand? So in both cases. Hadatna Abu Nurmani, hadatna hamad ibn Zaydin, hadatna ayub, an-nafair, an-ibnu umarah radiya Allahu an-huma, qalafaradun nabiya sallallahu alayhi wa sallama sadaqatal fitri, aqal rama dana, alad dakari wal unsa. He said the Prophet sallallahu alayhi wa sallam made saadakat ul fitr obligatory, aqala Ramadan or the sadaqah of Ramadan. He made this obligatory on who? On the male and the female, wal hudri wal mamluq, on the free and the slave, saar min tamrin, awsar min sharirin, isar of dates or isar of barley, fa adala naasubihi nisfa saar min burrin. And the people say that it's half isar of burr, burr as in wheat. Faqan ibn Umar radiya Allahu an-huma yu'upri tamra, ibn Umar used to give dates. And fa'ar wa zahul madinatimin at tamri, and one year what happened is that the people of Madina didn't have many dates, fa'ar wa tahsha'iran. So he gave barley. Faqan ibn Umara yu'upri an-isariri wal kabir, and ibn Umar used to give on behalf of the young and the old. Meaning those who were dependent on him, his children and also the adults. Hatta in kana yurukhiya an-baniyya, and he would even give on behalf of my sons. Whose sons? Who's saying this? Nafir. Nafir was the freed slave of Abdullah ibn Umar. So Nafir had sons and ibn Umar radiya Allahu anhu would give zakatul fitr for the sons of Nafir also. Because they were kind of his dependents. Wa kana ibn Umara radiya Allahu anhu ma yurukhiya al-ladina yaqbaloonaha. And he would give it to the people who would accept it, meaning the people who would collect it. So there were also zakatul fitr collectors at that time. Wa kana yurukhuna qabbal fitri biyawmin aw yawmai. And they used to give before fitr, meaning before Eid, by a day or two days. Meaning they would give zakatul fitr a day or two before Eid. To who? To the sadaqatul fitr collectors. Why? So that the sadaqatul fitr collectors could give it to the poor in time. Babb sadaqatul fitri al-as-sagiri wal-kabi. Sadaqatul fitr is owed by both the young and the old. Hadatana musaddat, hadatana yahya an-urbaydillah. Qala hadatana nina fiy'un an-ibni umarah radhiyallahu anhu. Again, ibn Umarah radhiyallahu anhu reported, Qala faradah Rasululahi sallallahu alaihi wa sallama sadaqatul fitri. The Prophet sallallahu alaihi wa sallam made sadaqatul fitr obligatory. Saarim min sha'ir, a saar of barley, ausaar min tambrin, or saar of dates, al-as-sagiri wal-kabi, on the young and the old, wal-hudri wal-mamluq, and the free and the slaves. So basically, everyone has to give sadaqatul fitr. Remember that when it comes to zakat, a person must have the wealth that reaches nisab. For gold there is a nisab, silver there is a nisab, even for sheep, cattle, etc. there is nisab. For zakatul fitr there is no nisab. It doesn't matter if you're a millionaire or you don't have that much money, you're living month to month. Zakatul fitr is to be given by who? By everyone. Now, if everyone is giving, who is receiving? That's the question. So, the scholars have said that yes, a person does not have to be saarib-un-nisab, meaning the person who has the money that reaches level of nisab to give zakatul fitr. However, if a person has one saar of food in addition to the food they have for the night and day, then they have to give zakatul fitr. You understand? So, if a person has just enough food for the night and day, for themselves and their family, for the people in the house, and on top of that food, in addition to that food, they also have a saar of any of these food items. They have that extra food. Then they have to give zakatul fitr. And if they don't have, then? Then they don't have to give it. Alright? So, this means that there is a person, they receive saatakatul fitr from one person, and another person, and another person, and now they have so much food, can they give saatakatul fitr? They can. And isn't that beautiful? This is the beauty, right? That this way, when everybody is giving, inshaAllah, everyone can have a share in this khayr. Remember that because it's also called zakat, and the recipients of zakat are only Muslims. So, saatakatul fitr is supposed to be given to Muslims only. This doesn't mean that you cannot feed non-Muslims. You can at other times. You have the whole year to do that. Even on Eid day, technically, you can feed them, but you cannot give them zakatul fitr. Zakatul fitr is the haq of the Muslim. In the Quran, we learn that the people of Jannah, the abraar, yut'imun at-taaam a'la huubihi, miskinan wa yatiman wa asirah. That they give food despite love for it to the needy, the orphan, and the prisoner. Now, who would be a prisoner at the time of the Prophet ﷺ? A Muslim or a non-Muslim? We're technically a non-Muslim, right? So they give food to them also. So there is no restriction when it comes to giving food. In general, you can give it to anybody, but zakatul fitr and zakat is the right of the Muslims. InshaAllah, we'll conclude over here. Subhanahu kallahu wa bihamdik. As-shadu Allahi illaaha illa anta astaghfiruka wa atubu ilaik. Wa alayhi wa barakatuh."}, "podcast_summary": "The podcast discusses the topic of Zakat al-Fitr, which is a mandatory charity given by Muslims at the end of Ramadan. The podcast emphasizes the importance of giving food rather than money for Zakat al-Fitr, as it aligns with the Prophet's teachings and ensures that people have enough to eat on Eid day. It also mentions the importance of giving Zakat al-Fitr before Eid Salah and the option of giving it in advance. The podcast clarifies that Zakat al-Fitr is mandatory for both free individuals and slaves, and it should be given to those in need. The summary also highlights the significance of giving food as part of the Islamic practice and symbol.", "podcast_eminent_personality_name": {"name": "Bab Sarma bin Zubeib", "link": "", "bio": ""}, "podcast_highlights": "In the podcast, the key topics discussed are:\n\n- The obligation of zakatul fitr and its timing (timestamp 1:34)\n- Giving food instead of money for zakatul fitr (timestamp 5:28)\n- The importance of feeding others in Islam (timestamp 9:22)\n- Who should zakatul fitr be given to? (timestamp 13:56)\n- The amount and type of food to be given for zakatul fitr (timestamp 17:40)\n- The obligation of zakatul fitr for both free people and slaves (timestamp 20:42)\n- No nisab requirement for zakatul fitr (timestamp 24:28)\n- The recipients of zakatul fitr should be Muslim (timestamp 26:52)"}