{"podcast_details": {"podcast_title": "Sahih Bukhari The Book Of Belief", "episode_title": "Episode-13-Lesson-20-Chapter-42-Hadith- 57-58", "episode_image": "http://alhudamedia.com/Fh_Podcast/Bukhari-02.png", "episode_transcript": " Assalamu alaikum wa rahmatullahi wa barakatuhu. Assalamu alaikum wa rahmatullahi wa barakatuhu. We praise him and pray for his noble messenger. After that, I seek refuge with Allah from the accursed Satan. In the name of Allah, the Most Gracious, the Most Merciful. O Lord, explain to me my heart and ease my matter. Unleash the pain in my tongue. Make it understand my words. O Lord, increase us in knowledge. Insha'Allah, we will go over the last chapter of the Book of Faith again. Okay? Insha'Allah. Chapter, Qawl an-Nabiyya Sallallahu alayhi wa sallam, the statement of the Prophet Sallallahu alayhi wa sallam, ad-deenu an-nasiha. Deen, religion is well wishing. Well wishing for who? Lillahi for Allah, walirasoolihi and also for his messenger, walia'immatil muslimina, and for the leaders of the Muslims, wa'ammatihim, and also the common Muslims or their masses. So in other words, well wishing for who? All of the Muslims. This Baab, Imam Bukhari gives it the chapter heading by mentioning the Hadith. Which Hadith? Which is mentioned over here, the ad-deenu an-nasiha. However, in the Baab, he doesn't actually mention the Hadith. There are two Hadith that are mentioned under this chapter heading, and neither of these are the one that is mentioned in the chapter heading. Why is it so that Imam Bukhari just referred to it and he did not actually mention it? Because he used it as a heading, but this Hadith, it does not meet the strict conditions of Imam Bukhari. Meaning the strict conditions of authenticity. It has been recorded by Imam Muslim, which shows that this Hadith is not weak. It is definitely authentic. However, it does not meet the strict criteria of Imam Bukhari, which is why he did not mention the Hadith, however he referred to it. He used it as a chapter heading. And the statement of Allah SWT, idha nasahulillahi warasulihi, went as long as they are well wishing, sincere to Allah and His messenger. If you look at the statement which is in the chapter heading, which is ad-deenu an-nasiha, that religion is nasiha. Does it mean that our religion only includes nasiha? No, our religion includes many, many things. The deen, iman, requires many things, but of the things that are part of iman, or of the things that our deen demands from us is nasiha. Then why is it said ad-deenu an-nasiha, religion is nasiha? To show how important nasiha is in our religion. To show how important it is in our deen. This is just like the Prophet SAW said, al-hajju arafah. Does it mean that hajj is only the day of arafah? No. If a person only goes and stands at arafah, is his hajj complete? No. Then what does it mean by al-hajju arafah? That arafah, the ritual of arafah is the most important one. It shows how very important it is. So similarly, an-nasiha is a major part of our deen, it's a major requirement of our deen, it's a major part of iman. An-nasiha to who? Lillahi wari rasulihi walia imatil muslimina wa ammatihim. To all. Nasiha, well wishing for who? For everyone. For Allah, His messenger, for the deen, and in the narration of iman muslim, we also learn that nasiha to also the book of Allah SWT. To His kitab, meaning to the Quran. This shows to us that our deen teaches us that we should have well wishing for everyone. That we should want good for others. This deen of ours, it creates positive feelings in a person, not negative. That people should become merciful, kind, generous, and not selfish, and not oppressive. And we see that the most deserving of our nasiha is who? First of all, Allah SWT, and also His messenger. But if you think about it, does Allah need our nasiha? Does the messenger need our nasiha? No. They don't require well wishing from us. Because whether we well wish for them or not, we cannot harm Allah and His messenger. For example, if you're not sincere to a person, if you don't want good for them, can you harm them? Yes you can. But can a person harm Allah and His messenger? They cannot. So what is meant by nasiha for Allah and His messenger? This is well wishing for who? Sincerity for who? The deen of Allah SWT. And nasiha for Allah and His messenger means obeying Allah and obeying the messenger. Because if you think about it, nasiha, what is it? It is to want good. For who? For the other. To be sincere to the other. Nusr, to be sincere to the other. Tawbatan nasuha, sincere repentance. So it is to want good for the other, genuinely. So when is a person genuine to Allah and His messenger? When is he sincere to them? When he will be obedient to them. So nasiha to Allah and His messenger is being obedient to Allah and His messenger. Similarly nasiha to Allah is that when a person worships Allah SWT, he does so with khudur, with fear, with humility. And that he has hope of Allah SWT's reward and fear of His punishment. Similarly nasiha to Allah means that a person prefers Allah SWT above everyone else. He gives Allah the highest priority. And the verse that is mentioned over here in the chapter heading, إِذَا نَصُحُ لِلَّهِ وَرَسُولِهِ This is a verse of Surah al-Tawbah in which we learn the only case where people are allowed to stay away from going out in the way of Allah is when there is a genuine reason preventing them, such as weakness or illness or not having the means to go. But what's the condition? That even at that time they should have nusr for Allah and His messenger. They should want good, meaning they should have sincerity. They should otherwise be obedient to Allah and His messenger. إِذَا نَصَحُ لِلَّهِ وَرَسُولِهِ What does it mean? That they should otherwise be obedient to Allah and His messenger. So nusr to Allah, to His messenger means obedience. إطاعا Then in the hadith, in this chapter heading, we also learn that نصيحة لأئمة المسلمين ائمة is plural of imam So how can a person have well wishing for the leaders of the Muslims? And by the way, the leader does not just mean the president or the khalifa, but it means any kind of imam. Whether he is someone who is leading you in prayer or he is teaching you or addressing you, what does it mean by well wishing for them? For example, obeying them, if they command you, if they instruct you to do something, obeying them, what else? Helping them in their tasks, yes? Respecting them, what else? All of this is included in well wishing. I'm asking you more examples so that we can have a clear understanding because only then can we do amul on this. That if you feel they need improvement somewhere, advise them. Don't just talk bad about them behind their back. No, advise them, correct them in the best way, in the most respectful way. Follow their rules that whatever rules, whatever principles they have set, observe them. What else? Supporting them, similarly having positive thinking about them, حسن الذن. حسن الذن about them, this is also very, very important. This is a part of نصيحة for the leaders. And then نصيحة for who else? For the common Muslims, for all people. How can we have نصيحة for the common Muslims? What does it mean by that? So for example, you want them to be guided because you want the best for them. When a person is well wishing for the other, he wants the best for them. So when you want the best for other Muslims, you want them to be guided. You want them to have علم. You want them to be educated. So you want good for them. So teaching them, guiding them, benefiting them, helping them. All of this is included in نصيحة with who? The ummah of the Muslims. What else is included? How can you show that you are well wishing for those who are around you, for the sisters who are with you? How can we show that? By not harming them, by protecting them from what could harm them, whether it is our tongue or it is our actions or it is our behavior, being merciful with them, helping them, being kind with them. You love for them what you love for yourself. You dislike for them what you dislike for yourself. So this is نصيحة for who? For the common Muslims. Now if you think about it, is it possible for us to have نصيحة at the same level for every single person? It's not possible. Because we are human beings and people are related to us in a different way. Isn't it so? The way your sister is related to you, the way your child is related to you, a stranger is not related to you in that way. But it doesn't mean that just because we don't know someone, just because they are not as close to us, we are not well wishing for them. We should also have نصيحة for those Muslims that we don't even know, that we do not even meet with on a regular basis, that perhaps we have never ever met. Now think about it. Those Muslims whom we come across every day, every other day, okay we can show well wishing to them in some way or the other, but what about those whom we don't even interact with? Those whom we don't even see, we don't even meet, how can we have well wishing for them? For example, making dua for them, making dua for their guidance, for their protection, for their safety, for their success in dunya and akhirah. Okay, so for example, if they are in difficulty, then helping them in that difficulty. So if they need food or clothing or financial assistance, helping them in that situation, sponsoring them, having positive supposition about them, giving salaam to them, tahaddu tahabbu. So there are many ways of showing nasiha for those Muslims that we don't even know. One thing that I'd like to mention over here is that as mothers, right, or as women, generally we are very, very concerned about our own children, our own families. Isn't it so? And we want the best for our children. We don't want their education to be compromised, we don't want their, you know, akhlaq or their upbringing or anything like that to be compromised at all. So many times it happens that we devote ourselves fully and completely to them, which is good. However, think about it, that if we spend all of our time on our own families only, then what about the rest of the children, what about the rest of the community? I remember a time came when I was discussing with my mother that I feel like homeschooling my child. I want to spend my time with him and I want to teach him and I feel that he has the ability and I can really, you know, teach him stuff. She said, why are you concerned about your own child only? Think about other children as well. Think about other children as well. And think about it, at this time, like if I give all of my time and all of my attention to only my child, would I be benefiting the rest of the people? It doesn't mean I have to deprive my child, no, he is in good hands, alhamdulillah, and I trust his teachers and I'm very glad that they are the ones who are teaching him. However, I have, where I am concerned for him, I should also be concerned for the rest of the Muslim community. I should also be concerned for the rest of the children because I can keep my child in my house and teach him all the good things, but the moment he steps out of the house, aren't other people going to influence him? Of course. So if I want good for my child, I want good for the rest of the community as well. This is why nasiha, not just for your own family, but for all of the Muslims. Because the Muslims are like one body, isn't it? When you are concerned about your body, are you only concerned about let's say your hand or your foot or just one part of your body? No. If you give attention to only one part and neglect the rest, isn't the rest going to get affected? And isn't that going to affect the part that you are trying to protect? Of course it will. So whenever, you know, it happens to us that whenever we see a problem anywhere, we become selfish and we say, okay, forget it, you know, I'm only going to worry about myself. The thing is that we need to worry about the entire Muslim community. We need to worry about all of them. This is nasiha for all of the Muslims. That if you don't stop the wrong outside, then eventually it's going to affect you as well. Eventually it's going to enter your house as well. And the thing is that we cannot live isolated lives. Our religion is such that we are supposed to have community. I mean, every Friday, all the Muslims are together, together in a bigger gathering and pray together. So as your children grow up, aren't they going to go to those gatherings? Of course they will. And when they go there, who's going to teach them the proper etiquette? Who? Is it other children who are going to be influencing them to do bad things? I don't want that. So if I want good for my child, I have to want good for the rest of the children as well. They need righteous company too. They also need righteous company. And the thing is that every single person does not have every skill in this world, isn't it? For example, I could have the ability to help older women, but my skill of teaching younger children, not good. I know that for myself. But I know that other people have that skill. So why don't we all pull in together, join our efforts, so that everyone can benefit. Everyone can take benefit from everyone else. Well wishing for the entire Muslim community. And then we see over here that there are darajat as well. Where we are supposed to have nasiha for all of the Muslim community, there are also darajat. Darajat in the sense that those who are closest to you definitely require more nasiha from you, as opposed to those who are farther away from you. But it doesn't mean that you neglect those who are away from us. Hadathana Musaddadun kala hadathana Yahya an Ismaila kala hadathani Qaisu ibn Abi Hazim an Jarir ibn Abdullah kala he said, baya'tu. I pledged allegiance to who? Rasulullah sallallahu alayhi wasallam, the messenger of Allah sallallahu alayhi wasallam, upon establishing the Salah wa ita'i al-zakat and giving the Zakah, wa nushi and well wishing li kulli Muslim for every single Muslim. When he became a Muslim, who? Jarir ibn Abdullah, he pledged allegiance to the Prophet sallallahu alayhi wasallam, and he promised that he would do certain things. And what were they? Performing the Salah, giving the Zakah, and also having well wishing for every single Muslim. If you think about it, performing the Salah, this is well wishing to who? Nasiha to who? Allah sallallahu alayhi wasallam, giving the Haq of Allah, right? Obeying Allah sallallahu alayhi wasallam, ita'i al-zakat, this is nasiha to who? To who? To the people. And then, wa nushi li kulli Muslim, every single Muslim, whether rich or poor, whether needy or not needy. Those whom you come across or those whom you do not come across, those who are related to you or those who are not related to you. Every single Muslim. So we see that well wishing to every Muslim is what? A part of Iman and it is also an act of worship. Because what is mentioned with Iqamul Salati, wa ita'i al-zakat. So establishing the Salah, giving the Zakah, well wishing to every Muslim, these are all acts of worship. Because you are obeying Allah, you are worshipping Allah. Nasiha is what? Wanting good, right? Wanting good, that whatever someone's haq is, you give that haq, that you please them. So Allah's haq is that he should be worshipped. Then ita'i al-zakat have ultimately the nasiha with people as well. When you meet together in the Salah congregation and you pay Zakah, it indirectly has the nasiha for people. Of course, very true. That one way through which we can have nasiha for all Muslims, even those that we don't know, is by presenting a good image of Islam. Because when we go out anywhere, people know us to be Muslims, we are not just representing our self only. People are looking at who the entire Muslim community is. It's as though you are representing the entire Muslim community. So if you are good, if you behave well, if you do what you are supposed to, then it's in a way your nasiha for who? For all of the Muslims, for all of the Muslim community. Hadathana abu al-nu'mani kala hadathana abu awanata an ziyad ibn ilaqata kala sami'utu I heard Jareed ibn Abdullah, Jareed ibn Abdullah, yaqulu, he was saying yawma on the day when matal mugheera, Mughira ibn Shu'ba, the day that he passed away. Matah, he passed away. Who passed away? Al-mughira ibn Shu'ba. Mughira ibn Shu'ba was a companion of the Prophet, sallallahu alayhi wa sallam, and he was appointed as the hakim, the ruler of Kufa, at the time when Mu'awiyah was the khalifa. So Mu'awiyah was the khalifa and al-mughira ibn Shu'ba, he was appointed as the ruler of Kufa. So he was a ruler, but he passed away. When he passed away, on that day, Jareed ibn Abdullah qaama, he stood up. He stood up where? On the mimbar, on the pulpit, in the masjid. And why would a person stand up on the pulpit in the masjid? To address the people. And remember at that time the masajid were not just places of worship, but there were also places where? Gatherings were, you know, took place and also people would learn knowledge, they were like institutes. He stood up over there to address the people, and how did he begin his address? He praised Allah, and he sent thana, meaning he glorified Allah, and he said, and this teaches us the proper etiquette, at the beginning of any address, what should be done? Allah subhanahu wa ta'ala should be praised. If you think about it, the Quran also begins with, Alhamdulillahi Rabbil alameen. The Salah also begins with the praise of Allah subhanahu wa ta'ala, the thana of Allah. Wa qala, and he said, Aleykum bittiqa'illahi, upon you, meaning you must have, be with ittiqa'illahi, having taqwa of Allah, meaning you must have taqwa of Allah, wahdahu, him alone, laa shariiqa lah, laa, not shariiqa, any partner lahoo for him. You must have taqwa of Allah, the one who has no partner. And you must also have, wal waqari, and you must also have, waqar, how did I translate waqar? Dignity, and also was sakina, sakina meaning tranquility, peace, calmness. Hatta until, ya'tiakum ameerun, your leader comes to you, until your leader comes to you, you must have waqar and sakina. You must stay calm, you must stay composed, and you must be dignified in the way that you behave, in the way that you consult one another. Why did Jarir Ibn Abdullah say this to the people? The people of Kufa, they were known to be very emotional, anything happened and they would react very emotionally. And we see that many major incidents of Islamic history took place in the city, around the city, or because of the people of the city. So imagine their leader passed away, Mughira bin Shurba passed away. Obviously you can imagine how people would be reacting, okay this person should be appointed the leader, no, that person should be appointed the leader. You never know, those people would have come up with any leader themselves without even consulting the Khalifa. It wouldn't be surprising if they did something like that. And you can imagine that if the leader is dead, what kind of chaos the people can fall into. Isn't it so? There can be division amongst people, there can be, you know, people can be confused, strife, you know, for power, power struggles. Many problems could happen at that time. So Jareed ibn Abdullah, because he was well wishing to the people, he stood up and he advised the people. And he advised them to remain calm until their leader would come. So indeed not but, he is coming to you just now. Meaning he's almost here, he should be here anytime. And who was the leader that was sent to them? We see that Amir Muawiyah, he sent their next leader and he said that his name was Ziyad. So he was on his way. So until the next leader came, Jareed ibn Abdullah, he advised the people, stay calm. Then he said, don't forget your leader who has passed away. Seek forgiveness. For who? For your leader. Don't forget him, seek forgiveness for him. And what it means by istirfu is that seek aafu. Seek forgiveness from who? From Allah SWT. And also from one another. Ask Allah to forgive him and ask each other to forgive him as well. Because a person, he needs forgiveness from who? Allah SWT as well as people. Because we are human beings and as human beings what do we do? We fall short in our duty to Allah SWT and we also fall short in our duty to who? To people. Our mistakes, our sins are sometimes against Allah and also against people. So when someone has passed away, we need to seek Allah's forgiveness for them. And we also need to seek other people's forgiveness for them. Meaning we should tell other people to forgive them. We should request them to forgive them. Remember when a young boy, he was at the verge of dying but his rooh was as though not leaving him. And he was in a lot of pain. So the people, they brought his case to the Prophet SAW and the Prophet SAW inquired about him. And the mother was very upset with the son, isn't it? So he requested the mother to forgive him. But she refused initially and then eventually she did forgive him. So just imagine, the wrong that we have done to people can affect us. At the time of our death and even afterwards. This is why it's necessary that when a person has passed away, we beg Allah to forgive him. And we also beg each other to forgive him. That he is gone. It's over now. Pardon him, forgive him. Want good for him. Have some well wishing for him. So istarful li amirikum. Because when a person has gone, can they seek forgiveness from you now? No, once they have passed away they cannot. So if you're really sincere to them, if you really want good for them, then ask other people to forgive them. Fa innahu, for indeed he, kaana, he was, yuhibbul afwa. He used to love, afwa, pardon. This may refer to Allah SWT, but in the context it seems more strong that it refers to Mughira ibn Sharba. That he used to love to forgive. So when he was so forgiving, you should also be forgiving to him. He forgave us and you should also forgive him. He is gone now. Fa innahu kaana yuhibbul afwa. Then he said, amma ba'du, as for after, fa inni. So indeed I. Ataytun nabiyya, Sallallahu alayhi wa sallam. I came to the messenger of Allah, Sallallahu alayhi wa sallam, and kultu, I said, u bayi'uka. I pledge allegiance to you. Ala al-Islam upon Islam. Meaning, I become a Muslim, I accept Islam and I pledge allegiance to you. Fa sharata alayya. So he set certain conditions on me. Sharata alayya. What does it mean by this? Sharata alayya. Meaning, he commanded me certain things that I had to perform. And what are they? Those actions which are a part of Islam. So sharata alayya, meaning sharata alayya al-Islam. A condition for me that I must observe Islam properly. So for example, Salah, Zakat, so on and so forth. But along with that, wal-nus'hi. And he also commanded me, he also set a condition for me that I must have a nus'h, well wishing for who? Likun li muslimin. For every single Muslim. So when I became a Muslim, the Prophet Sallallahu alayhi wa sallam told me, he made me promise that I would observe all the pillars, right? And also have well wishing for who? All of the Muslims. So I pledged allegiance to him upon this, for this, and then he said, wa rabbi, by the Lord of hada al-masjidi, this masjid. This masjid, which masjid is that? The one that he was standing in, addressing the people. And some have said that hada al-masjid, it's also possible that he's referring to the Ka'ba, right? The bayt al-haram. And hada al-masjid, perhaps he pointed towards that. Perhaps he pointed in the direction of the qibla when he was addressing the people. So he was swearing by Allah subhanahu wa ta'ala, the Rabb of the masjid. And this is a fact that Allah subhanahu wa ta'ala is the Rabb of every single masjid, because he is Rabbul al-alameen. So, wa rabbi hada al-masjidi, inni lanaasihul lakum, indeed, surely I am well wishing to you. Summa staghfara, then he sought forgiveness, and wa nazala. And he descended, meaning he descended from the pulpit. This was the well wishing of who? Jareer ibn Abdullah. To who? Mughira ibn Sha'bah, as well as the Muslim community. As well as the Muslim community. This was his well wishing to Allah and also his messenger, salallahu alayhi wasalam. How? That we see well wishing to Allah. Where can we see that in this hadith? alaykum bittiqa illaah Well wishing to the messenger. Where can we learn that? Whatever he learned from the messenger, he passed it on. Whatever he pledged allegiance for, he passed that on. He didn't keep that to himself. Well wishing to the leader of the Muslims. Mughira ibn Sha'bah, he was the leader, he passed away. He asked the people to seek forgiveness for him and also forgive him. And nasiha for all of the Muslims. How did he show that? When he stood up at that time, when it could be a time of fitna, he stood up, he calmed the people down and he advised them. And whatever knowledge he had, he shared it with them. So this is well wishing to Allah, his messenger, the leaders of the Muslims as well as the common Muslims. And if you think about it, this hadith, Imam Bukhari has mentioned it at the end of Kitaabul Iman. At the end of Kitaabul Iman. And it's the hadith right before Kitaabul Ilm. What's the connection over here? Well wishing for every Muslim, how? It comes from Iman, okay? And Amal, and that's based on knowledge. And one of the best ways through which you can have nasiha for all people is by imparting knowledge to them. And we see that Imam Bukhari, he has narrated the most authentic ahadith. And this was his well wishing. This was his nasiha. He could have passed on all of those ahadith, even those that were weak, that he knew about. But he chose the very best, the most authentic ones. If you think about it, in the chapter heading even, he mentioned ahadith, which is authentic but does not meet the strict conditions of authenticity near him. He doesn't narrate that hadith, but he narrates others. This was his well wishing. He passed on that knowledge. That if we show our well wishing to other people by, for example, helping them by, for example, giving them food or drink or anything, that's just of benefit to them in this world. But if you impart knowledge to them, then you're benefiting them for a much, much longer time. Its benefit is long lasting in this dunya and also in the akhirah. And we see that just as Jarid ibn Abdullah, he stood up and he addressed the people and he advised them. Imam Bukhari also, he imparted the knowledge. And then we see that he requested the people to seek forgiveness for their leader. And then at the end of his speech, he sought for istaghfarah and nazalah. So similarly, Imam Bukhari also, he concluded the chapter nazalah. But in a way he's hinting, seek forgiveness for me as well. Seek forgiveness for me as well. So he was well wishing to us and our well wishing towards him should be that we also make dua for him. The way you tried, it was not that appropriate. So learn from your mistakes and move on. It happens sometimes that you want good for the other person, but they misunderstand you or it doesn't come out right. Learn from your mistakes, improve yourself and move on. Seek forgiveness. And we see that in order to have nasiha for other people, do you need ilm for that? You need ilm for that. So iman, once you have iman, you must have nasiha for others. Nasiha for Allah that you obey Allah. But how can you obey Allah? How can you worship Him if you don't know? Nasiha for the messenger, you follow his sunnah, how can you do that? If you don't know. Nasiha for the leaders, how can you correct them? How can you advise them if you don't know? Nasiha for the general Muslims, how can you benefit them? How can you help them if you don't know? So iman demands nasiha from us. And nasiha can only be done when a person has ilm. And this is why it is important that we must study kitab with ilm as well. The Prophet Sallallahu Alaihi Wasallam was the one who had the most well wishing for the people. And because of that he imparted all the knowledge. Therefore it is necessary that we benefit from this knowledge and also pass it on to others. And benefit from this knowledge can only be possible if we study it. Inshallah we will conclude over here. Subhanakallahu wabihamdhika nashaduwa laa ilaha illa antaa nastaghfiruka wa natubu ilayk. Assalamu alaikum wa rahmatullahi wa barakatuhu."}, "podcast_summary": "The podcast discusses the concept of \"Nasiha\" which means well-wishing or sincerity. It explains that religion requires well-wishing for Allah, His Messenger, leaders, and all Muslims. The speaker emphasizes the importance of \"Nasiha\" in our religion and how it creates positive feelings and behaviors. They also discuss the conditions and examples of showing well-wishing to different groups. The example of the leader Mughira's passing and Jareer's address to the people demonstrates the importance of \"Nasiha\" in times of change or crisis. The speaker concludes by highlighting the importance of knowledge in practicing \"Nasiha\" and reminds listeners to seek forgiveness for those who have passed away, including Imam Bukhari.", "podcast_guest": {"name": "Imam Bukhari", "summary": ""}, "podcast_highlights": "1. The podcast discusses the importance of having well-wishing (Nasiha) for Allah, His Messenger, the leaders of the Muslims, and the wider Muslim community.\n2. Imam Bukhari uses the Hadith \"ad-deenu an-nasiha\" (religion is well-wishing) as the chapter heading, highlighting the significance of Nasiha in Islam.\n3. Nasiha to Allah and His Messenger means being sincere and obedient to them.\n4. Nasiha to the leaders of the Muslims includes obeying them, helping them, respecting them, and advising them when necessary.\n5. Nasiha to the wider Muslim community can be shown through acts of kindness, support, and positive thinking, even for those we don't know personally."}